[{"name":"Cheddar","description":"Cheddar is a widely popular cheese known for its rich and creamy flavor. It is made from cow's milk and has a slightly crumbly texture. The cheese is aged for different periods, resulting in a wide range of flavors and characteristics. Some cheddars have a sharp and tangy taste, while others are more mellow and buttery. Cheddar is a versatile cheese that can be used in various dishes, from grilled cheese sandwiches to macaroni and cheese. It pairs well with fruits, crackers, and wines.","category":"Hard cheese","price":"5.99","country_of_origin":"United Kingdom","weight":"200g","stock":12},{"name":"Brie","description":"Brie is a soft cow's milk cheese named after the Brie region in France. It is pale in color with a slight grayish tinge under a rind of white mold. The cheese has a creamy and smooth texture with a mild, buttery flavor. It is often served as a dessert cheese or as part of a cheese platter. Brie pairs well with fresh fruits, crusty bread, and Champagne.","category":"Soft Cheese","price":"$8","country_of_origin":"France","weight":"200 grams","stock":14},{"name":"Mozzarella","description":"Mozzarella is a semi-soft, stretchy cheese that originated in Italy. It is made from the milk of water buffalo or cow and has a mild, slightly tangy flavor. Mozzarella is known for its smooth and elastic texture, which makes it perfect for melting on pizzas or adding to salads. It is often used in Italian cuisine and is a popular choice for Caprese salads. This cheese is versatile and can also be enjoyed on its own or in sandwiches. Mozzarella adds a creamy and delicious touch to a variety of dishes.","category":"Semi-soft cheese","price":"$4.99","country_of_origin":"Italy","weight":"200g","stock":12},{"name":"Gouda","description":"Gouda is a semi-hard cheese with a creamy and buttery taste. It originates from the Netherlands and is named after the city of Gouda. This cheese is made from cow's milk and has a smooth, yellow interior and a red or yellow wax rind. Gouda is aged for different periods, ranging from a few weeks to several years, resulting in variations in flavor and texture. It is commonly enjoyed on cheese boards, sandwiches, or melted in various dishes. Gouda is priced at $5 per individual unit and weighs approximately 200 grams. We currently have 12 units in stock.","category":"Semi-hard cheese","price":"$5","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Blue cheese","description":"Blue cheese is a type of cheese made from the milk of cows, sheep, or goats that have been exposed to mold cultures, giving it its distinctive blue veins and tangy flavor. It has a creamy texture with a pungent aroma. Blue cheese is aged for several months to develop its unique characteristics. It is commonly used in various dishes, such as salads, pasta, and sauces, and pairs well with fruits and nuts. Blue cheese is a beloved culinary treasure.","category":"Cheese","price":"$8.99","country_of_origin":"Various countries, including France, Italy, and England","weight":"250 grams","stock":12},{"name":"Parmesan","description":"Parmesan is a hard, granular cheese that is made from cow's milk. It is aged for a minimum of 12 months, resulting in a rich and nutty flavor. The cheese has a pale yellow color and a crumbly texture. It is often used as a grating cheese and is a key ingredient in Italian dishes such as pasta, risotto, and soups. Parmesan is known for its savory and umami taste, adding depth of flavor to various dishes.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"200 grams","stock":15},{"name":"Camembert","description":"Camembert is a soft, creamy, and bloomy rind cheese made from cow's milk. It originated in France and is named after the village of Camembert in Normandy. The cheese has a rich and buttery taste, with a delicate and earthy aroma. It has a smooth and velvety texture that becomes runny as it ages. Camembert pairs well with crusty bread, fruits, and light-bodied wines. It is often used in cooking, especially in dishes like baked camembert and gourmet sandwiches.","category":"Soft cheese","price":"4.99","country_of_origin":"France","weight":"250 grams","stock":12},{"name":"Feta","description":"Feta is a brined cheese made from sheep's milk or a combination of sheep's and goat's milk. It has a crumbly texture and a tangy, salty taste. The cheese is aged for several months in brine, which gives it its characteristic flavor. Feta is often used in Mediterranean cuisine, and it pairs well with salads, grilled vegetables, and olives. With its creamy yet firm texture, Feta adds a salty and savory element to dishes. It is a versatile cheese that can be crumbled, sliced, or melted.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"Greece","weight":"200 grams","stock":10},{"name":"Roquefort","description":"Roquefort is a type of blue cheese made from sheep's milk. It is known for its distinctive tangy and slightly salty flavor, with veins of rich blue-green mold running through it. The cheese has a creamy and crumbly texture, making it perfect for smearing on crackers or crumbling over salads. Roquefort is aged for at least 3 months in natural limestone caves in the French region of Aveyron, which gives it a unique flavor. It is often considered one of the finest blue cheeses in the world.","category":"Blue Cheese","price":"10","country_of_origin":"France","weight":"200g","stock":15},{"name":"Gruyère","description":"Gruyère is a type of Swiss cheese made from cow's milk. It has a firm and dense texture with small to medium-sized holes scattered throughout. The cheese is known for having a nutty and creamy flavor profile, which becomes more pronounced as it ages. Gruyère is often used in cooking and pairs well with a variety of ingredients, making it a versatile choice for recipes such as fondue, quiches, and sandwiches. It is also delicious when enjoyed on its own, accompanied by fruits, crackers, or bread.","category":"Hard cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"200 grams","stock":15},{"name":"Gorgonzola","description":"Gorgonzola is a unique and versatile blue cheese with a rich and creamy texture. It is known for its distinct flavor profile that ranges from mild and buttery to sharp and tangy. Made from cow's milk, Gorgonzola develops blue veins and a crumbly texture as it ages. It pairs well with a variety of ingredients such as pears, nuts, honey, and red wine. Gorgonzola is a popular choice for cheese boards and is often used in salads, pastas, and sauces.","category":"Blue cheese","price":"$9.99","country_of_origin":"Italy","weight":"200 grams","stock":7},{"name":"Colby","description":"Colby is a semi-hard cheese made from cow's milk. It has a smooth texture and a mild, slightly tangy flavor. The cheese is usually produced in the shape of long cylindrical blocks, which are then cut into smaller portions for retail sale. Colby is often compared to cheddar cheese, but it is milder in taste and has a softer, more elastic texture. It is a popular choice for snacking, grating, and melting.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"United States","weight":"8 oz (226g)","stock":10},{"name":"Manchego","description":"Manchego is a Spanish cheese made from sheep's milk. It has a firm and compact texture with a buttery and creamy flavor. The cheese is aged for a minimum of 60 days, which gives it a distinctive and slightly salty taste. Manchego cheese pairs well with fruits and nuts, and it is often enjoyed on its own or as a key ingredient in traditional Spanish dishes like tapas and paella.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Spain","weight":"200 grams","stock":7},{"name":"Havarti","description":"Havarti is a semi-soft Danish cheese with a smooth and creamy texture. It is made from cow's milk and has a mild and buttery flavor. The cheese has small, irregular holes throughout and a pale yellow color. It is aged for around 3 months to develop its unique taste and texture. Havarti is often enjoyed on its own or melted on sandwiches and burgers. It pairs well with fruits, crackers, and light-bodied red or white wines.","category":"Semi-soft Cheese","price":"$5.99","country_of_origin":"Denmark","weight":"200 grams","stock":10},{"name":"Swiss","description":"Swiss cheese, also known as Emmental, is a classic cheese known for its distinctive holes. It is made from cow's milk and has a pale yellow color. The cheese has a nutty and slightly sweet flavor with a mild to medium sharpness. Swiss cheese is aged for about 4 to 12 months, resulting in a firm yet creamy texture. It is a versatile cheese that can be enjoyed on its own, melted in various dishes, or used in sandwiches and salads.","category":"Hard Cheese","price":"$6.99","country_of_origin":"Switzerland","weight":"1 pound","stock":10},{"name":"Monterey Jack","description":"Monterey Jack is a semi-hard cheese known for its smooth and creamy texture. It is made from cow's milk and has a delicate, buttery taste with a subtle tanginess. The cheese is typically aged for a short period, which gives it a mild flavor. It melts easily, making it a popular choice for dishes like quesadillas, nachos, and grilled cheese sandwiches. Monterey Jack is categorized as a semi-soft cheese and is often compared to Cheddar or Colby.","category":"Semi-hard","price":"$7.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Muenster","description":"Muenster is a semi-soft cheese with a smooth, pale yellow interior and an edible orange rind. It is made from cow's milk and has a tangy and buttery flavor. The cheese has a creamy and slightly elastic texture that becomes softer as it ages. It is typically aged for a minimum of 30 days, but can also be aged for longer periods to develop a stronger flavor. Muenster is often used as a sandwich cheese and melts well, making it a popular choice for grilled cheese sandwiches.","category":"Semi-soft cheese","price":"4.99","country_of_origin":"United States","weight":"8 oz","stock":15},{"name":"Provolone","description":"Provolone is a semi-hard cheese with a smooth and creamy texture. It is aged for several months, giving it a distinct and rich flavor. The cheese has a pale yellow color and a slightly tangy taste. It is often used in sandwiches, salads, and pasta dishes. Provolone is known for its excellent melting properties, making it a popular choice for cooking. Overall, it is a versatile and flavorful cheese that adds a wonderful touch to many dishes.","category":"Semi-hard cheese","price":"$7.99","country_of_origin":"Italy","weight":"200 grams","stock":15},{"name":"Fontina","description":"Fontina cheese is a creamy and semi-soft cheese originating from Italy. Made from cow's milk, it has a pale yellow color and a rich, earthy flavor with nutty undertones. Its texture is smooth and supple, making it perfect for melting in dishes like fondue or grilled cheese sandwiches. Fontina cheese has a mild aroma and a slightly tangy finish. It pairs well with crusty bread, cured meats, and fruity white wines. Enjoy this delicious cheese on its own or use it to elevate your favorite recipes.","category":"Semi-soft cheese","price":"5.99","country_of_origin":"Italy","weight":"200g","stock":15},{"name":"Emmental","description":"Emmental cheese is a Swiss cheese made from cow's milk. It is known for its distinctive large and round holes called 'eyes' that are formed during the fermentation process. The cheese has a pale yellow color and a slightly nutty and sweet flavor. It has a firm and elastic texture, making it easy to slice or shred. Emmental is a versatile cheese that can be enjoyed on its own, melted in sandwiches or used in various recipes. It pairs well with fruits, nuts, and even chocolates.","category":"Hard cheese","price":"$5.99","country_of_origin":"Switzerland","weight":"200 grams","stock":8},{"name":"Edam","description":"Edam is a semi-hard cheese that is named after the town of Edam in the Netherlands. It is known for its pale yellow color and smooth, creamy texture. The cheese has a mild and slightly tangy flavor with hints of nuttiness. It is usually aged for a few weeks to develop its distinctive taste. Edam cheese is often used as a table cheese and is great for melting. It pairs well with fruits, crackers, and breads.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Stilton","description":"Stilton is a classic English blue cheese that is known for its rich and tangy flavor. It has a crumbly texture with blue veins running through it, creating a unique and distinctive appearance. The cheese is traditionally made from cow's milk and aged for a minimum of nine weeks to develop its complex flavors. Stilton has a slightly sweet and nutty taste, with hints of mushroom and a salty finish. It is often enjoyed on its own or used as a delicious ingredient in salads, soups, and sauces.","category":"Blue Cheese","price":"$10","country_of_origin":"England","weight":"150 grams","stock":15},{"name":"Boursin","description":"Boursin is a soft, creamy cheese that originated in France. It is made from pasteurized cow's milk and is known for its rich and buttery flavor. The cheese has a smooth and spreadable texture, making it perfect for spreading on crackers or bread. Boursin is often flavored with herbs and spices like garlic and black pepper, adding a savory and aromatic twist to its taste. It pairs well with fruits and vegetables and is commonly served as an appetizer or part of a cheese platter.","category":"Soft Cheese","price":"$4.99","country_of_origin":"France","weight":"150 grams","stock":14},{"name":"Havarti","description":"Havarti is a semi-soft Danish cheese with a smooth, creamy texture. It is made from cow's milk and has a mild and buttery flavor. The cheese is typically aged for around 3 months, which gives it a slightly tangy taste. Havarti has a distinctive ivory color and a slightly elastic texture, making it perfect for melting. It pairs well with fruits, nuts, and crackers, and is a popular choice for sandwiches and cheese platters.","category":"Semi-soft cheese","price":"$5.99","country_of_origin":"Denmark","weight":"8 oz","stock":12},{"name":"Ricotta","description":"Ricotta is a creamy and mild Italian cheese that is made from the whey leftover from the production of other cheeses. It has a smooth texture and a slightly sweet flavor. Ricotta is often used in Italian cuisine, such as in lasagna, stuffed shells, and cannoli. It is also a popular filling for pastries and desserts. Overall, Ricotta is a versatile and delicious cheese that adds richness to a variety of dishes.","category":"Fresh Cheese","price":"$4.99","country_of_origin":"Italy","weight":"250g","stock":9},{"name":"Limburger","description":"Limburger is a soft, surface-ripened cheese with a creamy texture and a pungent aroma. It is made from cow's milk and has a distinct orange-brown rind that is slightly sticky. The cheese is aged for several weeks, which allows it to develop a strong and tangy flavor. It has been enjoyed for centuries and is often paired with dark bread and onions. Limburger is considered a classic cheese from Belgium and Germany.","category":"Soft cheese","price":"8.99","country_of_origin":"Belgium, Germany","weight":"200g","stock":12},{"name":"Pepper Jack","description":"Pepper Jack cheese is a semi-soft cow's milk cheese that is infused with spicy jalapeno peppers, giving it a distinct and fiery flavor. Its creamy texture makes it perfect for melting, making it a popular choice for sandwiches, burgers, and quesadillas. The jalapeno peppers provide a slight heat that nicely complements the rich and tangy taste of the cheese. Pepper Jack cheese is often used in Mexican and Southwestern cuisine, adding a delicious kick to dishes. It pairs well with a variety of ingredients like sliced tomatoes, avocado, and grilled chicken.","category":"Semi-soft Cheese","price":"$5.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Asiago","description":"Asiago is a traditional Italian cheese that is named after the Asiago Plateau in the Veneto region. It is a semi-hard cheese with a rich, nutty flavor and a smooth, creamy texture. The cheese is made from cow's milk and aged for different periods of time, resulting in two distinct varieties - Asiago Pressato, which is aged for a few weeks and has a mild, delicate taste; and Asiago d'Allevo, which is aged for several months and develops a more robust and tangy flavor. Asiago cheese is often grated or used as a table cheese, and it pairs well with fruits, nuts, and aged wines.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Italy","weight":"200 grams","stock":14},{"name":"Romano","description":"Romano cheese is a hard cheese that originated in Italy. It is made from sheep's milk or a combination of sheep's and cow's milk. It has a sharp and salty flavor, and a firm and crumbly texture. Romano cheese is aged for a minimum of 5 months, which gives it a more intense flavor. It is commonly used in Italian dishes such as pasta, salads, and soups.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"8 oz","stock":14},{"name":"Goat Cheese","description":"Goat cheese, also known as chèvre, is a type of cheese made from the milk of goats. It has a distinct flavor that is often described as tangy, creamy, and slightly sweet. The cheese is usually soft and spreadable, with a white or lightly colored rind. Goat cheese is incredibly versatile and can be used in a variety of dishes, from salads and pastas to desserts. It pairs well with fruits, nuts, and herbs, making it a popular choice for both sweet and savory recipes. Whether served on a cheese board or incorporated into a recipe, goat cheese adds a delightful and unique flavor to any dish.","category":"Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"4 oz","stock":13},{"name":"Roquefort","description":"Roquefort is a type of blue cheese made from sheep's milk. It is aged in the natural Combalou caves located in the South of France, giving it a unique and intense flavor profile. The cheese has a creamy texture with distinct blue-green veins running through it. It offers a perfect balance of tanginess and saltiness, with a rich and complex taste. Roquefort is often crumbled or melted in various culinary dishes, adding a savory and pungent flavor. It pairs well with sweet fruits, honey, and nuts.","category":"Blue Cheese","price":"$9.99","country_of_origin":"France","weight":"150 grams","stock":10},{"name":"Colby-Jack","description":"Colby-Jack cheese is a semi-hard cheese made from a blend of Colby and Monterey Jack cheeses. It has a slightly tangy and creamy flavor with a mild and smooth texture. The cheese is known for its unique marbled appearance, with alternating patches of orange and white. It is often used as a topping for burgers, sandwiches, and salads, or enjoyed on its own. Colby-Jack cheese is a popular choice for cheese platters and pairs well with fruits, crackers, and cured meats.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"United States","weight":"1 pound","stock":10},{"name":"Jarlsberg","description":"Jarlsberg is a mild, semi-soft cheese that originated in Norway. It is known for its distinctive sweet and nutty flavor, which comes from the aging process. The cheese has a smooth, creamy texture and features large round holes scattered throughout. Jarlsberg is versatile and can be enjoyed on its own or used in a variety of dishes such as sandwiches, omelets, and cheese boards. It is an excellent choice for those who prefer a milder cheese option. ","category":"Semi-soft Cheese","price":"$5.99","country_of_origin":"Norway","weight":"250 grams","stock":8},{"name":"Cotija","description":"Cotija is a hard, crumbly Mexican cheese that is made from cow's milk. It has a salty flavor with a slightly tangy and nutty taste. The cheese is aged for several months, which gives it a dry and crumbly texture. Cotija cheese is commonly used as a topping in Mexican cuisine, especially in dishes like tacos, enchiladas, and salads. It adds a rich and savory element to these dishes. Its unique flavor and texture make it a popular choice among cheese enthusiasts.","category":"Hard Cheese","price":"$6.99","country_of_origin":"Mexico","weight":"200 grams","stock":12},{"name":"Cammembert","description":"Cammembert is a soft, creamy cow's milk cheese with a bloomy rind. It originated in the Normandy region of France. The cheese has a rich, buttery flavor with earthy and mushroom-like undertones. Its texture ranges from firm when young to oozy and runny when fully ripe. Cammembert is typically served at room temperature and pairs well with crusty bread, apples, and a glass of red wine. It is often enjoyed as a dessert cheese or as part of a cheese platter.","category":"Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"250 grams","stock":12},{"name":"Feta","description":"Feta is a soft, brined cheese with a tangy and salty taste. It is made from sheep's milk or a mixture of sheep's and goat's milk. The cheese has a crumbly texture and is usually white in color. Feta cheese is widely used in Mediterranean cuisine and is a key ingredient in dishes such as Greek salad and spanakopita. It has a rich and creamy flavor that perfectly complements a variety of dishes.","category":"Cheese","price":"$5.99","country_of_origin":"Greece","weight":"200 grams","stock":12},{"name":"Halloumi","description":"Halloumi is a semi-hard, unripened cheese that originates from Cyprus. It is made from a combination of goat's and sheep's milk, with some variations using cow's milk as well. The cheese has a unique texture, with a slightly rubbery and springy consistency. It has a mild, salty flavor with a hint of tanginess. Halloumi is traditionally used in Mediterranean cuisine, often grilled or pan-fried due to its high melting point. It is a versatile cheese that can be enjoyed on its own, in salads, or as a filling in sandwiches and wraps.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Cyprus","weight":"250 grams","stock":14},{"name":"Queso Blanco","description":"Queso Blanco is a mild, fresh cheese originating from Latin America, particularly Mexico. It is a soft and creamy cheese with a slight tangy flavor. Made from cow's milk, Queso Blanco is known for its delicate texture and smooth meltability. It is often used in traditional Mexican cuisine, such as in enchiladas, quesadillas, and tacos. Queso Blanco pairs well with spicy and savory flavors and is an excellent choice for those who prefer a milder taste.","category":"Fresh Cheese","price":"4.99","country_of_origin":"Mexico","weight":"8 oz","stock":10},{"name":"Gorgonzola","description":"Gorgonzola is a creamy blue cheese made from cow's milk. It is named after the town of Gorgonzola in Italy where it originated. The cheese has a rich and tangy flavor with a distinctive blue veining. It has a crumbly texture and a pungent aroma. Gorgonzola is aged for several months, allowing it to develop its complex flavors. It is often used as a topping for salads, in pasta dishes, or as a spread on bread and crackers.","category":"Blue Cheese","price":"$8.99","country_of_origin":"Italy","weight":"150 grams","stock":12},{"name":"Gouda","description":"Gouda is a popular Dutch cheese known for its creamy texture and mild, buttery flavor. It is traditionally made from cow's milk and aged for varying lengths of time, resulting in different flavors and textures. The cheese typically has a pale yellow interior with a firm yet supple consistency. It pairs well with fruits, nuts, and crackers, and is often enjoyed on its own or melted in dishes. Gouda is a versatile cheese that can be used in a wide range of recipes, from sandwiches and salads to fondues and macaroni and cheese.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Netherlands","weight":"200g","stock":9},{"name":"Manchego","description":"Manchego is a cheese originally from Spain, made from the milk of Manchega sheep. It has a firm and compact texture with a creamy and slightly crumbly consistency. The flavor is rich and nutty, with hints of sweetness and a tangy finish. Manchego is aged for a minimum of 60 days, which gives it a distinct and complex flavor profile. It is a versatile cheese that can be enjoyed on its own, paired with fruits and nuts, or used in various recipes.","category":"Hard Cheese","price":"$8.99","country_of_origin":"Spain","weight":"200 grams","stock":15},{"name":"Bleu d'Auvergne","description":"Bleu d'Auvergne is a cow's milk cheese that originates from the Auvergne region in France. It is a semi-soft blue cheese with a creamy texture and a tangy, slightly salty flavor. The cheese is characterized by its blue veins, which are formed by the presence of Penicillium roqueforti mold. Bleu d'Auvergne has a distinctive aroma, a rich and creamy taste, and a slightly crumbly texture. It pairs well with fruits, nuts, and honey, and is often used in salads, pasta dishes, and cheese platters.","category":"Blue cheese","price":"$5.99","country_of_origin":"France","weight":"150 grams","stock":15},{"name":"Mozzarella di Bufala","description":"Mozzarella di Bufala is a soft, fresh cheese that is made from the milk of domesticated water buffaloes. It has a creamy texture and a mild, slightly tangy flavor. The cheese is traditionally made by stretching and kneading the curd to achieve its characteristic elasticity. The result is a cheese that is delicate and moist, with a slightly salty taste. Mozzarella di Bufala is often enjoyed in dishes like Caprese salad, where it is paired with fresh tomatoes and basil. It is also commonly used in pizza toppings and melted into pasta dishes.","category":"Fresh Cheese","price":"$8.99","country_of_origin":"Italy","weight":"125 grams","stock":12},{"name":"Provolone","description":"Provolone is a semi-hard Italian cheese that originated in Southern Italy. It is made from cow's milk and has a pale yellow color and a firm yet creamy texture. The cheese has a mild and slightly tangy flavor with hints of nuttiness and sweetness. Provolone is often aged, which intensifies its flavor and gives it a firmer texture. It is commonly used in sandwiches, pizzas, and as a topping for pasta dishes. Provolone is a popular cheese in the United States and is often enjoyed melted or sliced in deli sandwiches.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"Italy","weight":"200 grams","stock":17},{"name":"Brie","description":"Brie is a soft cow's milk cheese named after the French region Brie. It is pale in color with a slight grayish tinge under a rind of white mold. The cheese has a mild, creamy flavor with a buttery and mushroom-like aroma. Brie is often enjoyed as a spread on bread or crackers and pairs well with fruits, honey, and nuts. It is a popular choice for cheese platters and is often used in recipes for warm melted cheese dishes.","category":"Soft Cheese","price":"$10","country_of_origin":"France","weight":"200g","stock":15},{"name":"Emmental","description":"Emmental is a yellow, medium-hard cheese with characteristic large holes. It is named after the Emmental region in Switzerland where it originated. This cheese has a mild, nutty flavor with a slightly sweet and fruity aroma. It is aged for a minimum of 100 days to develop its distinct taste and texture. Emmental is a versatile cheese that can be enjoyed on its own or used in cooking, particularly in fondues, quiches, and sandwiches.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"200 grams","stock":13},{"name":"Paneer","description":"Paneer is a fresh cheese common in the Indian subcontinent. It is made by curdling milk with lemon juice or vinegar, and then straining the whey. The resulting cheese has a mild, slightly tangy flavor and a firm, crumbly texture. Paneer is a versatile cheese and is used in a variety of dishes, including curries, stir-fries, and desserts. It is a popular choice for vegetarian meals due to its high protein content. It is also a good source of calcium and vitamins.","category":"Fresh Cheese","price":"$4.99","country_of_origin":"India","weight":"200 grams","stock":10},{"name":"Cambozola","description":"Cambozola is a creamy blue cheese that combines the rich and smooth texture of Camembert with the tangy and earthy flavors of Gorgonzola. This German cheese is made from pasteurized cow's milk and aged for about 3-4 weeks. It has a bloomy rind that is white and soft, while the interior paste is creamy and marbled with blue veins. The taste is buttery and mild with a slight sharpness from the blue mold. Cambozola pairs well with fruits, bread, and red wines. It is a popular choice for cheese boards and can also be melted in recipes.","category":"Blue Cheese","price":"$8.99","country_of_origin":"Germany","weight":"250 grams","stock":12},{"name":"Gruyère","description":"Gruyère is a popular Swiss cheese known for its rich, nutty flavor and firm texture. It is made from high-quality cow's milk and aged for several months to develop its distinct taste. The cheese has a pale yellow color and is dotted with small holes throughout. Gruyère is a versatile cheese that can be enjoyed on its own, melted in sandwiches and gratins, or grated for use in fondue. Its complex and savory profile makes it a favorite choice for cheese lovers across the world.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"200 grams","stock":14},{"name":"Gouda","description":"Gouda is a semi-hard cheese that originated in the Netherlands. It is made from cow's milk and has a rich, creamy flavor with a slightly nutty taste. The cheese has a smooth and firm texture, with a pale yellow color. Gouda is aged for different periods, ranging from a few weeks to several years, which affects its flavor and texture. It is a versatile cheese that can be eaten on its own, melted on sandwiches, or used in various dishes. Gouda is a popular cheese worldwide and is loved for its mild yet distinctive taste.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Netherlands","weight":"250 grams","stock":14},{"name":"Muenster","description":"Muenster cheese is a semi-soft cheese with a smooth, creamy texture. It is made from cow's milk and has a mild, tangy flavor. The cheese has a pale yellow color and a slightly pungent aroma. It is often compared to a milder version of Limburger cheese. Muenster cheese is versatile and can be enjoyed on its own, in sandwiches, or melted in recipes. Some popular uses include grilled cheese sandwiches and macaroni and cheese.","category":"Semi-soft cheese","price":"$4.99","country_of_origin":"United States","weight":"8 oz","stock":14},{"name":"Rocquefort","description":"Rocquefort is a type of blue cheese made from sheep's milk. It is known for its creamy and crumbly texture, as well as its distinct sharp and tangy flavor. The cheese is aged in natural caves in the south of France, which gives it a unique character. It has a rich history dating back over a thousand years, and it is considered one of the finest blue cheeses in the world. Rocquefort pairs well with fruits, nuts, and honey, and is often used in salads, dressings, and sauces.","category":"Blue Cheese","price":"$10.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Danish Blue","description":"Danish Blue is a semi-soft cheese made from cow's milk. It has a creamy and crumbly texture with a salty and slightly tangy taste. The cheese is characterized by its blue veins, which are created by the addition of mold during the aging process. The flavor intensifies as the cheese ages, becoming sharper and more pungent. Danish Blue is a versatile cheese that can be enjoyed on its own, crumbled over salads, or melted into sauces. It pairs well with fruits, nuts, and breads. The cheese has a distinct aroma and comes wrapped in foil to preserve its freshness.","category":"Blue Cheese","price":"$5.99","country_of_origin":"Denmark","weight":"150g","stock":12},{"name":"Taleggio","description":"Taleggio is a soft and aromatic cheese that hails from Italy. It is named after the Val Taleggio region where it was first produced. The cheese has a thin, pinkish rind and a pale yellow interior. It is semi-soft in texture with a creamy and tangy flavor. Taleggio is often described as having earthy and mushroom-like undertones. It pairs well with fruits, nuts, and crusty bread. Whether enjoyed on its own or in cooking, Taleggio is a versatile cheese that adds depth of flavor to any dish.","category":"Semi-soft cheese","price":"8.99","country_of_origin":"Italy","weight":"250 grams","stock":12},{"name":"Port-Salut","description":"Port-Salut is a semi-soft cow's milk cheese that originated in France. It has a smooth and creamy texture with a mild and slightly tangy flavor. The cheese is aged for about 3 to 6 weeks, during which it develops a thin orange rind. The interior of the cheese is pale yellow and has small, irregular holes. Port-Salut is known for its versatility and is often enjoyed on its own or melted in sandwiches and gratins.","category":"Semi-Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"200 grams","stock":14},{"name":"Monterey Jack","description":"Monterey Jack is a semi-hard cheese with a smooth, creamy texture and a mild, buttery flavor. It originated in Monterey, California in the 19th century and was traditionally made from cow's milk. The cheese is aged for a short time, typically around one to three months, which gives it a slightly tangy taste. It is commonly used in Mexican and American cuisine, and it melts beautifully, making it perfect for dishes like quesadillas, nachos, and grilled cheese sandwiches. Monterey Jack is a versatile cheese that adds a delicious creaminess to any dish.","category":"Semi-hard Cheese","price":"$4.99","country_of_origin":"United States","weight":"200 grams","stock":10},{"name":"Colby","description":"Colby cheese is a type of semi-hard cheese made from cow's milk. It has a smooth and creamy texture with a mild and slightly tangy flavor. The cheese is pale yellow in color and has a soft, elastic texture. It is typically used for snacking, sandwiches, and melting in recipes. Colby cheese is often compared to cheddar cheese, but it has a milder flavor and is less crumbly. It pairs well with fruits, crackers, and breads.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Swiss","description":"Swiss cheese is a semi-hard cheese with a pale yellow color and distinctive holes throughout. It has a mild and slightly nutty flavor, making it a popular choice for sandwiches and melted dishes. This cheese is made from cow's milk and has been produced in Switzerland for centuries. It is classified as a semi-hard cheese with a smooth and creamy texture. Swiss cheese is often enjoyed on its own or paired with fruits and nuts. It is a versatile cheese that can be used in a variety of recipes.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Switzerland","weight":"200 grams","stock":12},{"name":"Fontina","description":"Fontina is a semi-soft Italian cheese with a nutty flavor and creamy texture. It is made from cow's milk and aged for about 3 months. The cheese has a pale yellow color and a thin rind. It has a mild and slightly sweet taste, with hints of earthiness and grassiness. Fontina is incredibly versatile and can be used in a variety of dishes, from melting it on sandwiches and pizzas to using it in fondues and gratins. It pairs well with both red and white wines.","category":"Semi-soft cheese","price":"$6.99","country_of_origin":"Italy","weight":"200 grams","stock":10},{"name":"Cabrales","description":"Cabrales is a traditional Spanish blue cheese made from a blend of cow's, sheep's, and goat's milk. It is aged in natural caves in the Picos de Europa mountains, which gives it a unique flavor and texture. The cheese is known for its strong and sharp flavor, with hints of spice and a creamy texture. It has a distinctive blue-green color and a slightly crumbly texture. Cabrales pairs well with crusty bread, fruits, and red wine.","category":"Blue Cheese","price":"$10","country_of_origin":"Spain","weight":"200 grams","stock":9},{"name":"Idiazábal","description":"Idiazábal is a smoked, smooth and slightly oily cheese made from raw sheep's milk. It is produced in the Basque Country and Navarre regions in Spain. The cheese is traditionally aged for a minimum of two months but can be aged up to a year. It has a distinctive smoky flavor with a nutty and buttery taste. Idiazábal is often enjoyed as a table cheese and pairs well with cured meats and crusty bread.","category":"Firm","price":"$12.99","country_of_origin":"Spain","weight":"250 grams","stock":12},{"name":"Pecorino","description":"Pecorino is a hard cheese made from sheep's milk. It originated in Italy and has a rich and tangy flavor. The cheese is aged for several months, which gives it a firm texture and a slightly nutty taste. Pecorino is often used in Italian cuisine, grated over pasta dishes or served alongside cured meats and olives. It pairs well with red wines and is a popular choice for cheese boards.","category":"Hard cheese","price":"$10","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Roquefort","description":"Roquefort is a famous blue cheese made from sheep's milk. It has a crumbly and creamy texture with distinct blue veins running through it. The flavor of Roquefort is rich, tangy, and slightly salty, with a unique sharpness. This cheese is aged for at least 3 months in natural limestone caves, which gives it a unique character and intensifies its flavors. Roquefort pairs well with sweet accompaniments like honey or figs, as well as bold red wines. It is a popular choice for cheese platters and adds a decadent touch to salads and sauces.","category":"Blue Cheese","price":"$10","country_of_origin":"France","weight":"150 grams","stock":14},{"name":"Feta","description":"Feta is a popular Greek cheese known for its crumbly texture and tangy flavor. Made from sheep's milk or a blend of sheep's and goat's milk, it is aged and preserved in brine, which gives it a salty taste. Feta has a creamy white color and is often used in salads, pastries, and as a topping for dishes. With its distinct taste and versatility, Feta has gained popularity worldwide.","category":"Soft cheese","price":"$5.99","country_of_origin":"Greece","weight":"200 grams","stock":10},{"name":"Gorgonzola","description":"Gorgonzola is a rich and creamy blue cheese originating from Italy. It is made from cow's milk and aged for 3 to 4 months, giving it a distinctively sharp and tangy flavor. The cheese has a crumbly texture with streaks of blue mold, which intensifies its flavor. Gorgonzola is often used in cooking, adding depth and creaminess to pasta dishes, salads, and sauces. It belongs to the blue cheese category, known for its unique aroma and flavor. The price per individual unit of Gorgonzola cheese is $5.99. It is produced in Italy, specifically in the regions of Lombardy and Piedmont. Each individual unit of Gorgonzola cheese weighs approximately 200 grams. Currently, we have a stock of 15 units available for purchase.","category":"Blue Cheese","price":"$5.99","country_of_origin":"Italy","weight":"200 grams","stock":15},{"name":"Edam","description":"Edam is a semi-hard cheese that originated in the town of Edam in the Netherlands. It is known for its distinctive round shape and wax coating. The cheese has a mild, slightly nutty flavor and a smooth texture. It is made from cow's milk and is typically aged for a few months. Edam cheese is commonly used in sandwiches, salads, and cooking. It pairs well with fruits, crackers, and light-bodied wines.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Asiago","description":"Asiago cheese is a traditional Italian cheese that originated in the Asiago plateau region. It is a semi-hard cheese with a smooth and creamy texture. The flavor of Asiago cheese can vary depending on the age. Young Asiago has a mild and slightly sweet taste, while the aged version is more intense and nutty. This cheese is often used in cooking and pairs well with a variety of dishes. It can be grated over pasta, melted in sandwiches, or enjoyed on a cheese platter.","category":"Semi-hard cheese","price":"$6.99","country_of_origin":"Italy","weight":"200g","stock":12},{"name":"Havarti","description":"Havarti is a semi-soft Danish cheese with a creamy texture and a buttery, slightly tangy flavor. It is made from cow's milk and has a pale yellow color. Havarti is known for its small and irregular eyes or holes throughout the cheese. It is aged for around 3 months to develop its distinctive taste and texture. Havarti can be enjoyed on its own, melted on sandwiches or burgers, or used in various recipes. It is a versatile cheese that adds richness and flavor to many dishes.","category":"Semi-soft cheese","price":"$4.99","country_of_origin":"Denmark","weight":"200 grams","stock":14},{"name":"Brie","description":"Brie is a soft cow's milk cheese with a bloomy rind that originated in France. It is named after the Brie region in northeastern France. Brie has a creamy, buttery texture and a mild, slightly tangy flavor. The cheese is typically aged for a few weeks to develop its characteristic taste and texture. Brie is a versatile cheese that can be enjoyed on its own, spread on crackers or bread, or melted in dishes like quiches and sandwiches.","category":"Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"200 grams","stock":10},{"name":"Camembert","description":"Camembert is a soft, creamy, and mildly flavored cheese that is typically made from cow's milk. It has a bloomy rind which is white and velvety, while the inside is pale yellow in color. This cheese has a rich and buttery taste with subtle hints of earthiness. It is aged for a few weeks to develop its unique flavors and textures. Camembert is a versatile cheese that can be enjoyed on its own, spread on bread or crackers, or used in cooking and baking.","category":"Soft cheese","price":"$5.99","country_of_origin":"France","weight":"250 grams","stock":9},{"name":"Gouda","description":"Gouda is a popular Dutch cheese known for its creamy texture and mild, slightly nutty flavor. It is made from cow's milk and aged for varying lengths of time, resulting in different intensity levels. This semi-hard cheese has a pale yellow interior and a natural rind. Gouda is versatile and can be enjoyed on its own, melted on sandwiches, or used in a variety of recipes. It pairs well with fruits, nuts, and wines. Whether you're a cheese connoisseur or just starting to explore different types, Gouda is a classic choice.","category":"Semi-hard cheese","price":"6.99","country_of_origin":"Netherlands","weight":"200 grams","stock":14},{"name":"Mozzarella","description":"Mozzarella is a traditional Italian cheese made from the milk of water buffaloes or cows. It is a semi-soft cheese with a milky and mild flavor. The cheese has a smooth and elastic texture and is commonly used in various Italian dishes, such as pizza, lasagna, and caprese salad. Mozzarella is known for its ability to melt into a creamy consistency, making it ideal for melting on top of dishes or shredding for use in recipes. It is a versatile cheese that adds a delicious and creamy touch to many dishes.","category":"Soft Cheese","price":"$5.99","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Parmesan","description":"Parmesan cheese, also known as Parmigiano-Reggiano, is a hard, granular cheese that is produced from cow's milk. It has a rich, nutty flavor and a firm texture that crumbles easily. Parmesan is aged for a minimum of 12 months, resulting in a complex taste profile. It is commonly used as a garnish for pasta dishes, grated over salads, or enjoyed on its own. With its origins traced back to Italy, Parmesan is a staple in many Italian recipes. The cheese is known for its high-quality and is protected by the Parmigiano-Reggiano Consortium.","category":"Hard Cheese","price":"10","country_of_origin":"Italy","weight":"200g","stock":7},{"name":"Provolone","description":"Provolone is an Italian cheese that originated in southern Italy. It is a semi-hard cheese with a pale yellow color and a slightly tangy flavor. The cheese is made from cow's milk and is aged for at least two to three months, which gives it a firm and smooth texture. Provolone is often used as a table cheese and is also a popular choice for melting on sandwiches or pizzas. It pairs well with meats and is commonly used in Italian-American dishes. Overall, Provolone is a versatile cheese with a rich and slightly smoky taste.","category":"Semi-hard","price":"$5.99","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Cheddar","description":"Cheddar is a widely popular cheese known for its sharp flavor and smooth texture. Made from cow's milk, it is aged for different durations to develop a range of flavors. Cheddar typically has a pale yellow color and a firm, crumbly texture. It has a rich, nutty taste with hints of fruitiness. Cheddar can be enjoyed on its own, melted in sandwiches or used as a key ingredient in various dishes like macaroni and cheese. It is a versatile cheese that pairs well with fruits, nuts, and wines.","category":"Hard Cheese","price":"$4.99","country_of_origin":"England","weight":"8 ounces","stock":15},{"name":"Boursin","description":"Boursin is a soft, creamy cheese known for its rich and indulgent taste. Made from cow's milk, it has a smooth and velvety texture that is spreadable and easy to enjoy. The cheese is infused with a blend of garlic and herbs, giving it a unique and savory flavor profile. Boursin is a versatile cheese that can be used in a variety of dishes, from appetizers to main courses. It pairs well with crackers, bread, and fresh vegetables, making it perfect for entertaining or enjoying as a snack. Try Boursin today and experience its delectable taste and creamy goodness!","category":"Soft Cheese","price":"5.99","country_of_origin":"France","weight":"150g","stock":12},{"name":"Muenster","description":"Muenster is a semi-soft cheese with a distinct orange rind and smooth creamy texture. It has a mild, slightly tangy flavor that becomes more pronounced as it ages. The cheese has a pale yellow interior that is sometimes dotted with small holes. Muenster is a versatile cheese that can be sliced and enjoyed on its own, melted on sandwiches or used in cooking. It pairs well with fruits, crusty bread, and light-bodied red wines.","category":"Semi-soft cheese","price":"$4.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Manchego","description":"Manchego is a famous Spanish cheese made from sheep's milk. It is produced primarily in the La Mancha region and has been granted Protected Designation of Origin status. The cheese has a firm and compact texture with a yellowish color. It has a sweet and nutty flavor, with hints of grass and herbs from the sheep's diet. Manchego is aged for a minimum of 60 days, but can be found in various stages of aging, each offering a unique taste experience. It pairs well with fruits, cured meats, and Spanish wines.","category":"Firm Cheese","price":"10","country_of_origin":"Spain","weight":"200g","stock":15},{"name":"Blue cheese","description":"Blue cheese is a type of cheese made with cow's, sheep's, or goat's milk that has been injected with cultures of the mold Penicillium. This mold gives blue cheese its characteristic blue or green veins and distinctive flavor. The cheese has a creamy and crumbly texture with a strong, tangy, and slightly salty taste. It is often used in salads, sauces, and dressings, and pairs well with fruits, nuts, and crackers. Blue cheese is a popular choice for cheese boards and adds a bold and robust flavor to any dish.","category":"Soft cheese","price":"8.99","country_of_origin":"Multiple countries","weight":"150 grams","stock":10},{"name":"Gruyère","description":"Gruyère is a hard cheese made from cow's milk that originates from the Swiss cantons of Fribourg, Vaud, Neuchâtel, and Jura. It has a pale yellow color and a firm, dense texture. The cheese has a rich, nutty flavor with a hint of sweetness. Gruyère is aged for a minimum of 5 months, which gives it a complex and robust taste. It is often used in cooking, especially in dishes like fondue and quiches. This cheese pairs well with crusty bread, grapes, and dry white wines.","category":"Hard Cheese","price":"12","country_of_origin":"Switzerland","weight":"200 grams","stock":8},{"name":"Pepper Jack","description":"Pepper Jack is a semi-soft cheese made from cow's milk. It has a smooth and creamy texture with a slight tanginess. This cheese is flavored with bits of jalapeno peppers, giving it a mild kick and a distinctive spicy taste. It has a yellow-orange color with marbled green and red specks from the peppers. Pepper Jack cheese is popular for its versatility and is commonly used in sandwiches, burgers, quesadillas, and nachos.","category":"Semi-Soft Cheese","price":"$5.99","country_of_origin":"United States","weight":"200 grams","stock":15},{"name":"Colby-Jack","description":"Colby-Jack is a mild and creamy cheese that combines the flavors of Colby and Monterey Jack. It has a smooth and slightly elastic texture with a mild, buttery taste. This cheese is known for its distinctive marbled appearance, with orange and white colors creating a beautiful pattern. It is perfect for melting, shredding, or snacking. Colby-Jack can be enjoyed on its own, in sandwiches, or melted on top of burgers. It is a versatile cheese that adds a delightful taste to any dish.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Ricotta","description":"Ricotta is a soft Italian cheese made from whey, a byproduct of the cheesemaking process. It has a creamy, slightly grainy texture and a mild, slightly sweet flavor. Ricotta is versatile and can be used in both sweet and savory dishes. It is commonly used in Italian desserts like cannoli, as well as in pasta dishes like lasagna. The cheese is rich in protein and calcium, making it a nutritious choice.","category":"Soft cheese","price":"$5","country_of_origin":"Italy","weight":"250 grams","stock":10},{"name":"Jarlsberg","description":"Jarlsberg cheese is a mild, semi-soft cheese from Norway. It has a pale yellow interior with a buttery, nutty, and slightly sweet flavor. The cheese has a smooth and supple texture, making it easy to slice and melt. It is known for its distinctive large round holes or 'eyes' and a smooth, waxed rind. Jarlsberg is often compared to Swiss cheese due to its similar flavor and appearance. It is a versatile cheese that can be enjoyed on its own, used in sandwiches, or melted in dishes like quiches and fondues.","category":"Semi-soft cheese","price":"$5.99","country_of_origin":"Norway","weight":"200 grams","stock":12},{"name":"Limburger","description":"Limburger is a soft, washed-rind cheese known for its pungent aroma and strong flavor. It is made from cow's milk and has a pale yellow interior with a smooth, creamy texture. The rind is reddish-orange in color and is formed by washing the cheese during the aging process. This cheese is matured for several weeks, which allows it to develop its characteristic strong and tangy taste. Limburger is often enjoyed spread on crackers or bread, and pairs well with onions, pickles, and dark beers.","category":"Soft Cheese","price":"$4.99","country_of_origin":"Germany","weight":"200 grams","stock":8},{"name":"Havarti","description":"Havarti is a semi-soft Danish cheese that is creamy and buttery with a slightly tangy flavor. It is made from cow's milk and has a smooth, pale yellow interior and a natural rind. The cheese has a rich, nutty aroma and a velvety texture that melts in your mouth. It pairs well with fruits, crackers, and bread and can be used in sandwiches, pastas, or melted in dishes. Havarti is a versatile cheese that is enjoyed by cheese lovers all around the world.","category":"Semi-soft cheese","price":"$5.99","country_of_origin":"Denmark","weight":"200 grams","stock":12},{"name":"Fontina","description":"Fontina is a semi-soft cheese made from cow's milk. It has a pale yellow color, a creamy texture, and a mild, nutty flavor with hints of mushroom. The cheese is aged for about three months, which gives it a slightly tangy and aromatic taste. Fontina is a versatile cheese that melts beautifully, making it perfect for dishes like fondues, gratins, and grilled cheese sandwiches. It pairs well with a variety of ingredients, including cured meats, fruits, and vegetables.","category":"Semi-soft cheese","price":"$8.99","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Goat Cheese","description":"Goat cheese, also known as chèvre, is a creamy and tangy cheese made primarily from goat's milk. It has a distinctive flavor and a slightly crumbly texture. The cheese is aged for a short period, which results in a milder taste compared to aged cheeses. It is commonly used in salads, sandwiches, and as a topping for pizzas. Goat cheese pairs well with fruits, honey, and a variety of herbs. Whether enjoyed on its own or incorporated into recipes, goat cheese adds a unique and delicious flavor to any dish.","category":"Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"4 oz","stock":12},{"name":"Cambozola","description":"Cambozola is a soft-ripened blue cheese from Germany. It is a unique combination of a rich and creamy camembert-style cheese with the distinct flavors of blue cheese. The rind is bloomy-white and the interior is creamy and marbled with blue veins. The taste is mild and buttery with a hint of tanginess from the blue mold. This cheese is balanced and versatile, making it a popular choice for both blue cheese lovers and those who prefer milder flavors.","category":"Semi-soft cheese","price":"$8.99","country_of_origin":"Germany","weight":"150 grams","stock":12},{"name":"Roquefort","description":"Roquefort is a famous blue cheese made from sheep's milk and has a creamy, crumbly texture. It is aged in limestone caves in the south of France, which gives it a distinct flavor. The cheese is characterized by its rich, tangy taste and its veins of blue mold that give it a pungent aroma. Roquefort pairs well with a variety of accompaniments such as honey, figs, and walnuts. It belongs to the blue cheese category and is often considered one of the finest examples of this type of cheese.","category":"Blue cheese","price":"$10","country_of_origin":"France","weight":"150 grams","stock":12},{"name":"Halloumi","description":"Halloumi is a semi-hard cheese that originated in Cyprus. Made from a mixture of sheep's and goat's milk, it has a unique texture and flavor. The cheese is typically white with a slightly salty taste and a firm, rubbery consistency. It is often used in Mediterranean cuisine and can be grilled or fried without melting, making it a popular choice for various recipes. Halloumi is a versatile cheese that can be enjoyed on its own or used as an ingredient in a variety of dishes.","category":"Semi-hard cheese","price":"$9.99","country_of_origin":"Cyprus","weight":"200g","stock":12},{"name":"Emmental","description":"Emmental is a Swiss cheese known for its distinctive appearance with large holes throughout the pale-yellow interior. It has a nutty, slightly sweet flavor that pairs well with fruits, nuts, and bread. The cheese is made from cow's milk and aged for at least three months, allowing its flavor to develop. Emmental is a versatile cheese that is widely used in cooking, especially in fondues and sandwiches.","category":"Hard cheese","price":"$8.99","country_of_origin":"Switzerland","weight":"1 pound","stock":14},{"name":"Stilton","description":"Stilton is a famous English blue cheese with a rich history and distinctive flavor. Made from pasteurized cow's milk, it is characterized by its crumbly texture and bold, complex taste. This cheese has a natural rind and a pale ivory interior that is marbled with blue veins. Stilton has an intense, tangy flavor with hints of earthiness and a slightly salty finish. It pairs well with fruits, crackers, and a full-bodied wine. It is a must-try cheese for blue cheese lovers.","category":"Blue Cheese","price":"10","country_of_origin":"England","weight":"200 grams","stock":14},{"name":"Cotija","description":"Cotija cheese is a Mexican cheese that originated in the town of Cotija in the state of Michoacán. It is a hard, crumbly cheese with a strong, salty flavor. Made from cow's milk, Cotija cheese is typically aged for several months, which enhances its flavor and gives it a distinctive crumbly texture. It is often used as a topping for dishes such as enchiladas, tacos, and salads. Cotija cheese is known for its rich and tangy taste, which adds a bold and savory element to any recipe.","category":"Hard cheese","price":"$5.99","country_of_origin":"Mexico","weight":"200g","stock":11},{"name":"Danish Blue","description":"Danish Blue is a type of blue cheese that originated in Denmark. It is made from cow's milk and has a creamy, crumbly texture with a distinct salty, sharp flavor. The cheese is aged for around 8-12 weeks, allowing the blue veins to develop and giving it a unique tangy taste. It is often used in salads, on cheese boards, or crumbled over dishes for added flavor. Danish Blue is a popular choice among cheese lovers for its strong flavor and creamy texture.","category":"Blue Cheese","price":"5.99","country_of_origin":"Denmark","weight":"200g","stock":8},{"name":"Paneer","description":"Paneer is a type of fresh cheese that is popular in South Asian cuisines, especially in India. It is made by separating the curds from the whey after adding an acidic agent, such as lemon juice or vinegar, to milk. The resulting curds are then pressed to form a solid cheese. Paneer has a mild and creamy flavor with a soft and crumbly texture. It is often used in various dishes like curries, stir-fries, and desserts.","category":"Cheese","price":"$5.99","country_of_origin":"India","weight":"200 grams","stock":12},{"name":"Caykur Tulum","description":"Caykur Tulum is a delicious cheese with a rich and creamy flavor. Made from the milk of cows raised in the lush green pastures of the Black Sea region in Turkey, this cheese is known for its unique taste and texture. It is aged for several months, which gives it a distinct and slightly tangy flavor. The cheese has a firm and crumbly texture, making it perfect for crumbling over salads or crumbling on top of pizzas. With its nutty and slightly salty taste, Caykur Tulum is a versatile cheese that can be enjoyed on its own or used in a wide range of recipes.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Turkey","weight":"200g","stock":14},{"name":"Perenzin","description":"Perenzin is a delicious artisanal cheese made from high-quality cow's milk. It is produced using traditional methods that have been passed down through generations. The cheese has a rich and creamy texture with a unique combination of flavors. It has a delicate and slightly tangy taste with hints of butter and nuttiness. The cheese is aged to perfection, allowing it to develop a complex and robust flavor profile. Perenzin is a versatile cheese that is perfect for snacking, cooking, or adding to your cheese board.","category":"Artisanal Cheese","price":"10","country_of_origin":"Italy","weight":"200g","stock":8},{"name":"Cheddar","description":"Cheddar is a popular cheese known for its smooth and creamy texture. It is made from cow's milk and has a rich, nutty flavor. The cheese is aged for different lengths of time, ranging from mild to extra sharp. It is versatile and can be enjoyed on its own, melted on sandwiches, or used in various recipes. Cheddar is commonly used in dishes like macaroni and cheese, burgers, and grilled cheese sandwiches.","category":"Hard Cheese","price":"$5.99","country_of_origin":"England","weight":"200g","stock":15},{"name":"Port-Salut","description":"Port-Salut is a semi-soft cow's milk cheese hailing from the Loire Valley in France. It has a smooth and creamy texture with a mild and slightly tangy flavor. Made from pasteurized cow's milk, Port-Salut is aged for about four weeks, allowing it to develop a thin, orange rind. This cheese melts beautifully, making it perfect for sandwiches or melting on top of dishes. It pairs well with fruity white wines and adds a rich and creamy touch to any cheese platter.","category":"Semi-soft","price":"$6.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Taleggio","description":"Taleggio is a semi-soft, washed-rind cheese that originated in the Lombardy region of Northern Italy. It is made from cow's milk and has a thin, reddish-orange rind. The cheese has a creamy, buttery texture with a mild, tangy flavor. It is aged for about six to ten weeks, during which it develops a distinctive aroma that can be described as earthy and mushroom-like. Taleggio is often used in Italian cuisine, particularly in dishes like risotto, pasta, and salads. It pairs well with red wines and is a popular choice in cheese platters.","category":"Semi-soft","price":"$8.99","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Monterey Jack","description":"Monterey Jack is a semi-hard cheese with a creamy and mild flavor. It is made from cow's milk and has a smooth texture that melts easily. The cheese has a pale yellow color and a slightly tangy taste. It is often compared to Cheddar, but it is more delicate and less sharp. Monterey Jack is a versatile cheese that can be enjoyed on its own, melted on sandwiches or burgers, or used in various recipes.","category":"Semi-hard cheese","price":"$4.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Pecorino","description":"Pecorino is a family of hard Italian cheeses made from ewe's milk. It originates from the regions of Lazio, Sardinia, and Tuscany. The cheese has a dense and firm texture with a rich, sharp, and slightly salty flavor. It is often aged for different periods, ranging from a few months to several years, which gives it distinct characteristics and complexity of taste. Pecorino is commonly used in cooking, grated over pasta dishes, soups, or salads, and pairs well with various fruits, nuts, and wines.","category":"Hard Cheese","price":"$10","country_of_origin":"Italy","weight":"200g","stock":14}]