[{"name":"Asiago","description":"Asiago is a mild and creamy cheese with a smooth texture and a subtle nutty flavor. It is made from cow's milk and originates from the Asiago Plateau in the Veneto region of Italy. The cheese is aged for different lengths of time, resulting in two varieties: Asiago Pressato, which is aged for a shorter period and has a milder taste, and Asiago d'Allevo, which is aged for a longer period and has a stronger flavor. This versatile cheese can be enjoyed on its own, shredded over pasta dishes, or melted in sandwiches and pizzas.","category":"Hard Cheese","price":"9.99","country_of_origin":"Italy","weight":"200 grams","stock":8},{"name":"Brie","description":"Brie is a soft cow's milk cheese named after the Brie region in France. It is pale in color with a white rind and has a mild flavor that becomes stronger as the cheese ages. Brie is known for its creamy texture and is often enjoyed spread on crackers or baguettes. It pairs well with fruits and is a popular choice for cheese platters.","category":"Soft Cheese","price":"10","country_of_origin":"France","weight":"250g","stock":15},{"name":"Camembert","description":"Camembert is a soft, creamy, surface-ripened cow's milk cheese. It has a bloomy white rind that is edible and a creamy, buttery interior. This cheese is known for its rich and distinct flavor, which is both savory and slightly tangy. It pairs well with crusty bread, fresh fruits, and dry white wines. Camembert originated in Normandy, France, where it is still primarily produced today.","category":"Soft Cheese","price":"$4.99","country_of_origin":"France","weight":"250 grams","stock":15},{"name":"Dorset Blue Vinney","description":"Dorset Blue Vinney is a traditional, crumbly blue cheese with a creamy texture. Made using pasteurized cow's milk, this cheese has a rich and tangy flavor profile. It is aged for 8 to 12 weeks, allowing the blue veins to develop and giving it a distinct character. Dorset Blue Vinney is a perfect choice for blue cheese lovers who appreciate bold and robust flavors. It pairs well with crackers, bread, and fruits.","category":"Blue Cheese","price":"$8.99","country_of_origin":"England","weight":"150 grams","stock":12},{"name":"Emmental","description":"Emmental is a popular cheese known for its characteristic holes. It is a Swiss cheese that is made from cow's milk. The cheese has a pale yellow color and a mild, nutty flavor. It has a firm yet slightly elastic texture, making it perfect for slicing or melting. Emmental is an excellent choice for cheeseboards and sandwiches. It pairs well with fruits, nuts, and dry white wines. Emmental is priced at $5 per individual unit. It is made in Switzerland and each unit weighs approximately 250 grams. Currently, we have 12 units of Emmental in stock.","category":"Hard Cheese","price":"$5","country_of_origin":"Switzerland","weight":"250 grams","stock":12},{"name":"Feta","description":"Feta is a crumbly and tangy cheese with a rich and creamy texture. Made from sheep's milk or a combination of sheep's and goat's milk, it is typically aged in brine, which gives it its characteristic salty flavor. Feta is often used in Mediterranean and Middle Eastern cuisine and is a versatile cheese that can be crumbled over salads, stuffed in pastries, or enjoyed on its own. It pairs well with olives, tomatoes, and fresh herbs. Feta is a staple in Greek cuisine and is believed to have originated in Greece.","category":"Soft Cheese","price":"$7.99","country_of_origin":"Greece","weight":"200 grams","stock":14},{"name":"Gouda","description":"Gouda is a popular Dutch cheese that is named after the city of Gouda in the Netherlands. It is a semi-hard cheese with a creamy and smooth texture. Gouda has a slightly nutty and buttery flavor, which becomes more intense as it ages. This cheese is often enjoyed on its own, melted in sandwiches, or used in various recipes. Gouda is a versatile cheese that pairs well with fruits, crackers, and wine.","category":"Semi-hard cheese","price":"5.99","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Halloumi","description":"Halloumi is a semi-hard, brined cheese originating from Cyprus. It is traditionally made from sheep's milk, although variations using cow's or goat's milk are also common. The cheese has a unique texture and taste due to the high melting point, which allows it to be grilled or fried without losing its shape. Halloumi has a salty and slightly tangy flavor, making it a popular choice for salads, sandwiches, and as a vegetarian grilling option. It is often enjoyed with watermelon or drizzled with honey for a contrasting sweet and savory experience.","category":"Semi-hard cheese","price":"6.99","country_of_origin":"Cyprus","weight":"250g","stock":12},{"name":"Irish Cheddar","description":"Irish Cheddar is a popular cheese known for its rich and creamy taste. It is made from cow's milk and aged for a minimum of 9 months to develop its distinctive flavor. The cheese has a smooth and firm texture, with a pale yellow color. It has a slightly sharp and nutty taste, with hints of sweetness. Irish Cheddar is a versatile cheese that can be enjoyed on its own, as a snack, or used in a variety of dishes. It pairs well with apples, pears, and crusty bread. It is also delicious when melted on burgers or in grilled cheese sandwiches.","category":"Cheddar","price":"6.99","country_of_origin":"Ireland","weight":"8 oz","stock":8},{"name":"Jarlsberg","description":"Jarlsberg is a mild, semi-soft cheese of Norwegian origin. It has a mild, nutty flavor and a rich aroma. The texture is smooth and creamy, with small, irregular holes spread throughout. Jarlsberg is made from cow's milk and is known for its distinctive sweet and nutty taste. It is a versatile cheese that can be enjoyed on its own, melted on sandwiches, or grated over pasta dishes.","category":"Semi-soft cheese","price":"$4.99","country_of_origin":"Norway","weight":"200g","stock":12},{"name":"Kefalotyri","description":"Kefalotyri is a hard, salty, and aged cheese made from sheep's milk. It has a crumbly texture and a rich, tangy flavor. This Greek cheese is often used in traditional dishes like saganaki, a fried cheese appetizer, and moussaka, a baked eggplant and meat dish. Kefalotyri is also delicious when grated over pasta or salads. It is a popular choice for grilling or frying as it retains its shape and develops a crispy outer layer. The cheese is aged for at least three months to develop its distinctive taste and texture.","category":"Hard Cheese","price":"8.99","country_of_origin":"Greece","weight":"200g","stock":16},{"name":"Leerdammer","description":"Leerdammer is a popular semi-hard cheese with a smooth and creamy texture. It is made from the milk of cows that graze on the lush pastures of the Netherlands. This cheese has a mild and slightly nutty flavor, making it versatile and enjoyable for a variety of palates. Leerdammer is perfect for sandwiches, melting on burgers, or simply enjoyed on its own with a glass of wine. It is a great alternative to traditional Swiss cheese, perfect for those who enjoy a milder taste.","category":"Semi-Hard Cheese","price":"3.99","country_of_origin":"Netherlands","weight":"200g","stock":15},{"name":"Manchego","description":"Manchego is a popular sheep's milk cheese from Spain. It is named after the region of La Mancha, where it is traditionally made. This cheese has a firm and compact texture, with a pale ivory color. It has a slightly salty and nutty flavor, with a hint of sweetness. Manchego is aged for a minimum of 3 months, but it can also be found in 6-month and 12-month aged varieties, which have a stronger and more intense flavor. This cheese is often enjoyed on its own, but it can also be paired with fruits, cured meats, and dry wines.","category":"Sheep's Milk Cheese","price":"9.99","country_of_origin":"Spain","weight":"200 grams","stock":7},{"name":"Nacho Cheese","description":"Nacho Cheese is a popular cheese that is often used as a topping for nachos, but it also has many other culinary uses. It has a smooth and creamy texture with a tangy and savory flavor. This cheese is made from a blend of cheddar cheese and spices, giving it a delicious and bold taste. It is perfect for adding a cheesy and flavorful kick to any dish. Whether you're making nachos, quesadillas, or macaroni and cheese, Nacho Cheese is a versatile cheese that will enhance the taste of your favorite dishes.","category":"Processed Cheese","price":"$5.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Oaxaca","description":"Oaxaca cheese is a traditional Mexican cheese that originated in the state of Oaxaca. It is known for its distinctive stringy texture, which makes it perfect for melting. Oaxaca cheese is made from cow's milk and has a mild, slightly tangy flavor. The cheese is often used in Mexican cuisine, especially in dishes like quesadillas and enchiladas. It is also great for topping tacos and tostadas. Oaxaca cheese is a versatile and delicious option for any cheese lover.","category":"Cheese","price":"$5.99","country_of_origin":"Mexico","weight":"8 oz","stock":14},{"name":"Paneer","description":"Paneer is a fresh cheese popular in the Indian subcontinent. It is made by curdling milk with the help of lemon juice or vinegar, and then straining the whey. The resulting cheese is soft and smooth, with a mild and milky flavor. Paneer is a versatile cheese that holds its shape well when cooked, making it a popular ingredient in Indian cuisine. It is often used in dishes like palak paneer, paneer tikka, and mattar paneer. Paneer is also a good source of protein and calcium.","category":"Fresh Cheese","price":"$4.99","country_of_origin":"India","weight":"200 grams","stock":12},{"name":"Queso Blanco","description":"Queso Blanco is a fresh and mild cheese that originated in Mexico. It is a creamy white cheese with a smooth and soft texture. Made from cow's milk, Queso Blanco has a slightly salty and tangy flavor that is similar to cottage cheese. It is a versatile cheese that can be used in a variety of dishes, such as quesadillas, tacos, and enchiladas. Queso Blanco is often crumbled or melted and adds a creamy and tangy element to any dish.","category":"Fresh Cheese","price":"5","country_of_origin":"Mexico","weight":"200g","stock":10},{"name":"Ricotta","description":"Ricotta is a soft Italian cheese made from the whey of sheep, cow, or goat milk. The cheese has a delicate, slightly sweet flavor with a creamy texture. It is often used as a filling for pasta dishes like ravioli, cannelloni, and lasagna, as well as desserts like cheesecake and cannoli. Ricotta is also a popular ingredient in Italian pastries and breakfast dishes like ricotta pancakes and ricotta toast. It is a versatile cheese that pairs well with fresh fruits, honey, and herbs.","category":"Soft Cheese","price":"5","country_of_origin":"Italy","weight":"250g","stock":"12"},{"name":"Stilton","description":"Stilton is a rich and creamy blue cheese with a crumbly texture. It is made from pasteurized cow's milk and has a distinct flavor that is both tangy and salty. The cheese is aged for a minimum of nine weeks to develop its unique character and the blue veins that run through it. Stilton pairs well with fruits, nuts, and dessert wines, making it a popular choice for cheese boards. It is a true British classic that has been enjoyed for centuries.","category":"Blue Cheese","price":"$9.99","country_of_origin":"England","weight":"150g","stock":7},{"name":"Tilsit","description":"Tilsit is a semi-hard cheese with a pale yellow color and a slightly tangy flavor. It is made from cow's milk and has a firm yet creamy texture. The cheese is aged for several months, which gives it a slightly pungent aroma. Tilsit is known for its smooth, buttery taste and is often enjoyed melted on sandwiches or grated over pasta dishes.","category":"Semi-hard Cheese","price":"$9.99","country_of_origin":"Germany","weight":"200 grams","stock":10},{"name":"Urgelia","description":"Urgelia is a semi-soft cow's milk cheese that originated in the Catalonia region of Spain. It is a blend of pasteurized cow's milk and cream, giving it a rich and creamy texture. The cheese has a pale yellow color and a smooth, buttery flavor with hints of fresh grass and nuts. It is aged for about two months, resulting in a mild yet complex taste. Urgelia is often compared to young Gouda or Fontina due to its creamy texture and versatility in various culinary preparations.","category":"Semi-soft Cheese","price":"8","country_of_origin":"Spain","weight":"200 grams","stock":10},{"name":"Valdeon","description":"Valdeon is a blue cheese with a soft and creamy texture. It is made from a blend of cow's and goat's milk, which gives it a unique flavor profile. The cheese is aged for several months, allowing it to develop a complex and tangy taste. Valdeon is known for its distinctive blue veining, which adds visual appeal to any cheese board. This cheese pairs well with fruits, nuts, and honey, making it perfect for both savory and sweet dishes.","category":"Blue cheese","price":"$10","country_of_origin":"Spain","weight":"200g","stock":8},{"name":"Wensleydale","description":"Wensleydale is a popular English cheese that originated in the Wensleydale region of North Yorkshire. It is a crumbly cheese with a slightly sweet and milky flavor. The cheese is made from cow's milk and has a pale ivory color. Wensleydale is often enjoyed on its own or paired with fruits such as apples or pears. It is also frequently used in sweet and savory dishes like cheese and onion pie. The distinctive flavor and texture of Wensleydale make it a favorite among cheese lovers.","category":"Hard Cheese","price":"10","country_of_origin":"England","weight":"200g","stock":"7"},{"name":"Xynotyro","description":"Xynotyro is a traditional Greek cheese made from sheep's and goat's milk. It has a rich and creamy texture with a slightly tangy flavor. The cheese is aged for a short period of time, which gives it a fresh and slightly salty taste. Xynotyro is commonly used in traditional Greek dishes such as spanakopita and tiropita. It is also delicious on its own or as a topping for salads. The cheese is a true taste of Greece and is loved by cheese enthusiasts worldwide.","category":"Fresh Cheese","price":"9.99","country_of_origin":"Greece","weight":"200 grams","stock":10},{"name":"Yarg","description":"Yarg is a semi-hard cheese made from cow's milk. It is named after the original producer, Allan Grey, who first made it in the 1980s. The cheese is wrapped in nettle leaves, which impart a unique earthy flavor and a striking appearance. The aging process gives Yarg a creamy texture with a tangy, slightly nutty taste. It pairs well with fruits, crackers, and wine.","category":"Semi-hard","price":"$10","country_of_origin":"United Kingdom","weight":"200 grams","stock":7},{"name":"Zamorano","description":"Zamorano is a Spanish cheese made from the milk of Churra sheep in the region of Castile and León. It is a hard cheese with a firm and crumbly texture. The flavor is intense and slightly tangy, with hints of nuts and herbs. Zamorano cheese has a rich and complex taste that intensifies with age. It is aged for a minimum of 6 months, which gives it a distinctive and robust flavor profile. The cheese is often enjoyed with crusty bread and paired with full-bodied red wines.","category":"Hard Cheese","price":"9","country_of_origin":"Spain","weight":"500 grams","stock":14},{"name":"Appenzeller","description":"Appenzeller is a traditional Swiss cheese that is made from unpasteurized cow's milk. It has a distinctively fruity and nutty flavor, with a hint of spiciness. The cheese is aged for a minimum of three months, resulting in a firm and slightly crumbly texture. It is often used in melting dishes and pairs well with fruits and cured meats. Appenzeller cheese is classified as a semi-hard cheese in the Swiss cheese spectrum. It is a popular choice among cheese lovers around the world.","category":"Semi-hard cheese","price":"$7.99","country_of_origin":"Switzerland","weight":"250 grams","stock":14},{"name":"Buffalo Mozzarella","description":"Buffalo Mozzarella is a kind of Italian cheese made from the milk of the domestic water buffalo. It is known for its soft and creamy texture, delicate flavor, and slightly tangy taste. The cheese is made by stretching the curd and forming it into balls that are traditionally stored in whey or water. Buffalo Mozzarella is commonly used in Caprese salads, as a topping for pizza, and in various other Italian dishes. It is a beloved cheese that is considered a delicacy in many parts of the world.","category":"Soft Cheese","price":"10","country_of_origin":"Italy","weight":"250 grams","stock":"12"},{"name":"Cotija","description":"Cotija is a hard, crumbly Mexican cheese made from cow's milk. It is named after the town of Cotija in the state of Michoacán. The cheese has a dry and grainy texture, similar to Parmesan cheese, and a unique salty and tangy flavor. It is commonly used as a garnish for dishes like tacos, salads, and soups. Cotija cheese is often referred to as the 'Parmesan of Mexico' due to its resemblance to the Italian cheese. Enjoy its rich taste and texture in your favorite Mexican dishes!","category":"Hard Cheese","price":"7","country_of_origin":"Mexico","weight":"250g","stock":8},{"name":"Danablu","description":"Danablu, also known as Danish Blue Cheese, is a semi-soft blue cheese with a creamy texture and tangy flavor. It is made from cow's milk and has a distinctly sharp and salty taste. The cheese is aged for two to three months, which gives it a unique crumbly texture and bold flavor. The blue veins running through the cheese are a result of the introduction of penicillium mold during the production process. Danablu is a versatile cheese that can be enjoyed on its own, crumbled over salads, or melted into sauces. It pairs well with sweet fruits and dessert wines.","category":"Blue Cheese","price":"10","country_of_origin":"Denmark","weight":"200g","stock":12},{"name":"Edam","description":"Edam is a semi-hard cheese that originates from the Netherlands. It is named after the town of Edam in North Holland. The cheese has a pale yellow interior with a smooth and firm texture. It has a mild, slightly nutty flavor that becomes sharper with age. Edam is typically known for its round shape and red wax coating, which helps preserve the cheese and gives it a distinctive appearance. This cheese is often enjoyed on its own or used in sandwiches, salads, and various dishes.","category":"Semi-hard cheese","price":"$5.99","country_of_origin":"Netherlands","weight":"250 grams","stock":12},{"name":"Camembert","description":"Camembert is a soft, creamy, bloomy-rinded cheese with a rich, buttery flavor. It is made from cow's milk and has a smooth, velvety texture. The cheese is aged for a few weeks, allowing it to develop a pungent aroma and a slightly earthy taste. It pairs well with a crusty baguette and can be enjoyed on its own or used in various recipes. Camembert hails from the Normandy region of France and has a long history dating back to the late 18th century.","category":"Soft cheese","price":"$5.99","country_of_origin":"France","weight":"250 grams","stock":12},{"name":"Gruyere","description":"Gruyere is a popular Swiss cheese known for its nutty and slightly sweet flavor. It has a firm yet creamy texture, with small, scattered holes throughout. This cheese is made from cow's milk and aged for at least five months, developing a rich and complex taste. Perfect for melting in dishes like fondue or adding depth to sandwiches and gratins, Gruyere is a versatile cheese that pairs well with fruits, nuts, and wines. With a buttery aroma and a golden brown rind, it is a true delight for cheese lovers.","category":"Hard Cheese","price":"10","country_of_origin":"Switzerland","weight":"200g","stock":15},{"name":"Havarti","description":"Havarti is a semi-soft cheese with a creamy, buttery flavor and a subtle tanginess. It has a smooth and supple texture, making it spreadable and perfect for melting. This Danish cheese is aged for around 3 months, which allows it to develop a slightly acidic and nutty taste. Havarti pairs well with both sweet and savory flavors, making it versatile for various dishes. It is commonly used in sandwiches, pasta dishes, and as a table cheese.","category":"Semi-Soft Cheese","price":"5.99","country_of_origin":"Denmark","weight":"200 grams","stock":12},{"name":"Italian Fontina","description":"Italian Fontina is a semi-soft cheese with a smooth and creamy texture. It has a subtle nutty flavor with hints of honey and mushrooms. This cheese is made from cow's milk and is aged for about 3 months, allowing it to develop a rich and complex taste. It pairs well with fruity red wines and can be used in a variety of dishes, such as grilled cheese sandwiches and fondue.","category":"Semi-Soft Cheese","price":"$10","country_of_origin":"Italy","weight":"250g","stock":8},{"name":"Jarlsberg","description":"Jarlsberg is a semi-soft, mild and creamy Norwegian cheese. It is named after a small town in Norway called Jarlsberg. This cheese is made from cow's milk and has a mild, nutty taste. It has a distinctive sweet and buttery flavor with a smooth texture. Jarlsberg is known for its large, round holes that are evenly distributed throughout the cheese. It is perfect for melting on sandwiches, in soups or gratins, or simply enjoyed on its own.","category":"Semi-soft cheese","price":"$7.99","country_of_origin":"Norway","weight":"200 grams","stock":10},{"name":"Kopanisti","description":"Kopanisti is a traditional Greek cheese known for its strong flavor and creamy texture. It is made from a blend of cow's, sheep's, and goat's milk, which gives it a unique and complex taste. The cheese is aged for several months, allowing it to develop its rich and tangy flavors. Kopanisti has a slightly spicy and salty taste, with hints of garlic and herbs. It is often used as a spread or dip and pairs well with bread, crackers, or vegetables.","category":"Blue cheese","price":"$9.99","country_of_origin":"Greece","weight":"200 grams","stock":7},{"name":"La Serena","description":"La Serena is a soft, creamy cheese made from the milk of Merino sheep in Spain. It is named after the region of La Serena, where it originated. This cheese has a rich and buttery flavor with hints of grassiness and a slightly tangy finish. The texture is silky and smooth, with a gooey interior that becomes almost runny at room temperature. La Serena is typically enjoyed spread on crusty bread or crackers and pairs well with fruity red wines.","category":"Soft cheese","price":"$10","country_of_origin":"Spain","weight":"250 grams","stock":12},{"name":"Mahon","description":"Mahon is a semi-hard cow's milk cheese that is produced on the island of Menorca, Spain. It has a creamy and slightly salty taste, with a firm yet supple texture. The cheese is aged for at least two months, which gives it a rich and complex flavor profile. Mahon is often used in cooking, as it melts well and adds a delicious depth of flavor to dishes. It pairs beautifully with fruits, breads, and wines.","category":"Semi-hard","price":"$8.99","country_of_origin":"Spain","weight":"200 grams","stock":12},{"name":"Naxos Graviera","description":"Naxos Graviera is a delicious Greek cheese that has a rich and nutty flavor. Made from sheep's milk, it is aged for a minimum of three months to develop its distinct taste and texture. This cheese is characterized by its pale yellow color and smooth, firm texture. Naxos Graviera is perfect for grating over pasta dishes or serving on a cheese platter.","category":"Hard cheese","price":"$10","country_of_origin":"Greece","weight":"200g","stock":15},{"name":"Oklahoma Cheddar","description":"Oklahoma Cheddar is a classic American cheese known for its rich and sharp flavor. Made from the finest quality cow's milk, this cheddar is aged to perfection for a minimum of 9 months, resulting in a smooth and creamy texture with a tangy bite. Its distinctive orange color adds vibrancy to any cheese board, and it pairs exceptionally well with crisp apples, crusty bread, or a glass of full-bodied red wine.","category":"Cheddar","price":"$9.99","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Pecorino","description":"Pecorino is a hard Italian cheese made from sheep's milk. It has a firm texture and a rich, nutty flavor. The cheese is aged for several months, which gives it a slightly sweet and caramelized taste. Pecorino is often grated over pasta dishes or used as a table cheese. It pairs well with red wines and is a popular choice for cheese boards.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"200g","stock":12},{"name":"Quark","description":"Quark is a fresh and creamy cheese that originates from Germany. It is made by curdling soured milk and then straining it to remove the whey. Quark has a smooth and spreadable texture, similar to yogurt or cottage cheese, and a tangy flavor that is slightly acidic. It is often used as a versatile ingredient in both sweet and savory dishes, such as cheesecakes, dips, and spreads. Quark is rich in protein and low in fat, making it a popular choice for those seeking a healthy dairy option.","category":"Fresh Cheese","price":"4.99","country_of_origin":"Germany","weight":"250 grams","stock":12},{"name":"Roquefort","description":"Roquefort is a famous blue cheese made from sheep's milk in southern France. It has a distinct creamy texture with veins of blue mold throughout. The cheese has a rich, buttery flavor with a tangy and slightly salty taste. Roquefort is aged in natural caves which gives it a unique character and enhances its flavors. It pairs wonderfully with sweet wines and fruits, making it a favorite choice for cheese boards and desserts. Enjoy this truly exceptional cheese that is loved by cheese connoisseurs around the world.","category":"Blue Cheese","price":"$9.99","country_of_origin":"France","weight":"150 grams","stock":14},{"name":"Stichelton","description":"Stichelton is a classic British blue cheese that is made using traditional methods and unpasteurized cows' milk. It has a rich and creamy texture with a complex flavor profile. The cheese is aged for a minimum of three months, allowing it to develop a well-balanced taste with hints of butter, nuts, and a subtle sweetness. Stichelton belongs to the blue cheese category and is often compared to its close relative, Stilton. It is priced at $10 per individual unit and is made in England. Each unit of Stichelton weighs approximately 200 grams. Currently, we have 14 units of Stichelton in stock.","category":"blue cheese","price":"$10","country_of_origin":"England","weight":"200 grams","stock":14},{"name":"Tallegio","description":"Tallegio cheese is a soft, creamy cheese that originates from the Lombardy region in Italy. It is made from cow's milk and has a mild flavor with hints of fruitiness. The cheese has a slightly pungent aroma and a thin, edible rind. It is often described as having a velvety texture that melts in the mouth. Tallegio is a versatile cheese that pairs well with both sweet and savory flavors. It is commonly used in various Italian dishes and is loved by cheese enthusiasts around the world.","category":"Soft Cheese","price":"$6.99","country_of_origin":"Italy","weight":"200 grams","stock":12},{"name":"Uniekaas","description":"Uniekaas is a high-quality cheese that is known for its creamy texture and rich flavor. It is aged for a perfect amount of time to develop its unique taste. Made with the finest ingredients and traditional techniques, Uniekaas is a favorite among cheese connoisseurs. With its nutty undertones and smooth consistency, it pairs well with a variety of foods and is a delicious addition to any cheese plate. Enjoy the indulgence of Uniekaas!","category":"Hard cheese","price":"$9.99","country_of_origin":"Netherlands","weight":"200g","stock":12},{"name":"Vacherin","description":"Vacherin is a semi-soft cheese that originates from the Jura region in France. It is made from cow's milk and has a creamy and buttery texture. The cheese has a pale yellow color with a natural rind. It has a rich and earthy flavor with hints of nuts and mushrooms. Vacherin is often enjoyed melted and is particularly popular in fondue recipes. It pairs well with dry white wine and is a great addition to cheese platters.","category":"Semi-soft cheese","price":"$9.99","country_of_origin":"France","weight":"250 grams","stock":10},{"name":"West Country Farmhouse Cheddar","description":"West Country Farmhouse Cheddar is a delicious cheese with a rich, creamy flavor. Made using traditional methods, it is aged for 9 to 24 months to develop its distinct taste and texture. This cheddar cheese has a firm yet crumbly texture, making it perfect for snacking or adding to your favorite dishes. It pairs well with crackers, fruits, and a glass of wine. Each bite of this farmhouse cheddar is a delightful combination of tangy and nutty flavors.","category":"Cheese","price":"$5.99","country_of_origin":"United Kingdom","weight":"200 grams","stock":13},{"name":"Xanadu","description":"Xanadu is a unique and delicious cheese that offers a taste of heaven in every bite. Made with love and passion, it is crafted using traditional methods passed down through generations. The cheese has a creamy texture with hints of nuttiness and a subtle tang. Its flavor profile is a perfect balance of savory and sweet, making it a versatile cheese that can be enjoyed on its own or incorporated into a variety of dishes. Whether you're hosting a fancy dinner party or just treating yourself, Xanadu is sure to impress.","category":"Artisan","price":"$9.99","country_of_origin":"France","weight":"200g","stock":14},{"name":"Yorkshire Blue","description":"Yorkshire Blue is an award-winning semi-soft blue cheese that is creamy, smooth, and slightly crumbly. It is made using traditional methods and has a distinct flavor with a hint of sweetness. This cheese is perfect for anyone who enjoys a milder blue cheese that is not overpowering. The creamy texture pairs well with crusty bread, fresh fruit, or a drizzle of honey. It is aged for 8 weeks, which gives it a depth of flavor and a beautiful blue marbling throughout.","category":"Blue Cheese","price":"7.99","country_of_origin":"England","weight":"150 grams","stock":12},{"name":"Zabriskie","description":"Zabriskie is a unique and flavorful cheese that originates from the Italian region of Lombardy. It is made from cow's milk and has a semi-firm texture with small eyes throughout. The cheese has a rich and nutty flavor with hints of both sweetness and sharpness. It pairs perfectly with crusty bread and dried fruit. The production process involves careful aging, resulting in a complex and delicious cheese.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"250g","stock":14},{"name":"Beaufort","description":"Beaufort is a semi-hard, pressed paste cheese that is made from cow's milk. It originates from the Beaufortain region in the French Alps. The cheese has a rich and nutty flavor with a hint of sweetness. It has a smooth and firm texture, with small holes scattered throughout. Beaufort is often used in traditional dishes such as fondue and gratins. It pairs well with dry white wines and fruity red wines.","category":"Semi-hard cheese","price":"$12","country_of_origin":"France","weight":"200 grams","stock":13},{"name":"Camenbert","description":"Camenbert is a soft, creamy, and slightly salty cheese made from cow's milk. It has a bloomy white rind and a rich, buttery flavor with hints of mushroom. This cheese is aged for about two weeks, during which it develops a velvety texture and a strong aroma. The Camenbert cheese pairs well with crusty bread, apples, and a glass of wine. It is a classic French cheese that has gained popularity worldwide.","category":"Soft Cheese","price":"$5.99","country_of_origin":"France","weight":"250 grams","stock":10},{"name":"Dolcelatte","description":"Dolcelatte is a soft Italian cheese that is similar to Gorgonzola. It is made from pasteurized cow's milk and has a creamy texture with a slightly sweet flavor. The cheese is aged for about 3 months, which gives it a milder taste compared to other blue cheeses. Dolcelatte is often used as a spread or crumbled over salads and pasta dishes. It pairs well with fruits like pears and grapes. Try this delightful cheese on a cheese board or incorporate it into your favorite recipes.","category":"Blue Cheese","price":"$7.99","country_of_origin":"Italy","weight":"150 grams","stock":11},{"name":"Epoisses","description":"Epoisses is a French cheese known for its strong aroma and creamy texture. It is made from cow's milk and has been produced in the Burgundy region of France since the 16th century. The cheese is aged for several weeks, during which it develops a distinctive orange color and a rich, pungent flavor. Epoisses is often described as having a savory, meaty taste with notes of nuts and mushrooms. It is best enjoyed spread on bread or paired with fruit and wine.","category":"Soft, washed-rind cheese","price":"12","country_of_origin":"France","weight":"250 grams","stock":12},{"name":"Fynbo","description":"Fynbo is a creamy and rich cheese with a distinct flavor. Made with high-quality milk from local farms, it is aged to perfection, resulting in a smooth and buttery texture. This cheese is perfect for cheese platters, sandwiches, or simply enjoyed on its own. Its unique flavor profile makes it a favorite among cheese connoisseurs. Try Fynbo today and experience the taste of excellence.","category":"Soft Cheese","price":"$5","country_of_origin":"Denmark","weight":"200 grams","stock":12},{"name":"Goudse Oplegkaas","description":"Goudse Oplegkaas is a traditional Dutch cheese that is matured for at least two years. It has a firm and crumbly texture, with a rich and intense flavor. This cheese is made from cow's milk, which gives it a smooth and creamy taste. Goudse Oplegkaas is known for its unique nutty and caramel-like undertones, making it a favorite among cheese connoisseurs. Enjoy it on its own or pair it with crackers and fruits for a delightful cheese platter.","category":"Aged Cheese","price":"$9.99","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Hutsefluts","description":"Hutsefluts is a delicious artisanal cheese made with care and expertise. It has a unique flavor profile that combines creamy and tangy notes, making it a favorite among cheese enthusiasts. The cheese is crafted using traditional methods passed down through generations of skilled cheesemakers. It pairs perfectly with bread, crackers, and a variety of fruits. Hutsefluts is a versatile cheese that can be enjoyed on its own or incorporated into a variety of recipes. It is a true delight for cheese connoisseurs.","category":"Artisanal Cheese","price":"9.99","country_of_origin":"Netherlands","weight":"200g","stock":17},{"name":"Idaho Goatster","description":"Idaho Goatster is a unique and delicious cheese handcrafted in the heart of Idaho. Made from 100% goat's milk, it offers a delightful blend of flavors that combine rich creaminess with a subtle tanginess. The cheese has a smooth and creamy texture, with a slightly crumbly consistency. It is aged to perfection, allowing the flavors to develop and intensify. Idaho Goatster is a versatile cheese that can be enjoyed on its own, grated over salads, or melted into a variety of dishes.","category":"Goat's Milk Cheese","price":"12","country_of_origin":"United States","weight":"8 oz","stock":14},{"name":"Jalapeno Havarti","description":"Jalapeno Havarti is a creamy and flavorful cheese with a hint of heat. Made from cow's milk, it is a semi-soft cheese that has been flavored with jalapeno peppers. The cheese has a smooth and slightly tangy taste, with a spicy kick from the jalapenos. It is perfect for adding a little extra flavor to sandwiches, burgers, or your favorite Mexican dishes. Enjoy this indulgent cheese with your favorite wine or as a snack on its own.","category":"Semi-Soft Cheese","price":"$5.99","country_of_origin":"Denmark","weight":"8 oz","stock":9},{"name":"Kasseri","description":"Kasseri is a traditional Greek cheese that is known for its semi-hard texture and tangy flavor. Made from sheep's milk, it is aged for about three months, which gives it a slightly firm yet creamy consistency. Kasseri has a distinctive golden yellow color and a mild yet slightly salty taste. It is commonly used in Greek cuisine, especially in dishes like saganaki, where it is fried and served with lemon. Kasseri is a versatile cheese that can be enjoyed on its own, melted in sandwiches, or grated over pasta dishes.","category":"Semi-hard cheese","price":"$9","country_of_origin":"Greece","weight":"250g","stock":12},{"name":"Livarot","description":"Livarot is a soft and creamy cheese with a distinctive pungent aroma. It is made from cow's milk and has a rich and complex flavor. The cheese is aged for about 3 weeks, during which time it develops a smooth and supple texture. Livarot is often referred to as the 'Colonel' due to the distinctive striped wrapping that distinguishes it from other cheeses. It is a popular cheese in Normandy, France.","category":"Soft","price":"$8.99","country_of_origin":"France","weight":"250 grams","stock":14},{"name":"Mimolette","description":"Mimolette is a semi-hard, aged French cheese with a unique appearance. It is often referred to as \"the orange cannonball\" due to its round shape and distinctive orange-colored rind. The cheese has a smooth and creamy texture with a nutty and slightly salty flavor. It is aged for several months to develop its complex flavors. Mimolette is typically enjoyed on its own, as a snack, or grated over dishes like pasta or salads.","category":"Semi-hard cheese","price":"$12","country_of_origin":"France","weight":"250g","stock":14},{"name":"Nordic Swiss","description":"Nordic Swiss is a mild and creamy cheese with a slightly nutty flavor. It is made from cow's milk and has a smooth and firm texture. The cheese is aged for about three months, allowing it to develop a rich and balanced taste. Nordic Swiss is a versatile cheese that can be enjoyed on its own, melted on sandwiches or used in various recipes. It pairs well with fruits and nuts, making it a perfect addition to a cheese platter. Try Nordic Swiss today and experience the delightful flavors of this Swiss-inspired cheese.","category":"Semi-hard","price":"$7.99","country_of_origin":"Sweden","weight":"200g","stock":13},{"name":"Ossau-Iraty","description":"Ossau-Iraty is a traditional Basque cheese made from raw sheep's milk. It is a semi-hard cheese with a smooth, creamy texture and a rich, nutty flavor. The cheese is aged for a minimum of three months, which gives it a deep, complex taste. The rind is dry and moderately thick, with natural molds adding to the flavor. Ossau-Iraty is often enjoyed with fruit, bread, or a glass of red wine.","category":"Semi-hard cheese","price":"$9.99","country_of_origin":"France","weight":"200 grams","stock":15},{"name":"Pannerone","description":"Pannerone is a rich and creamy Italian cheese with a firm texture and a mild, buttery flavor. Made from cow's milk, it is aged for several months to develop a sweet and nutty taste. This cheese is versatile and can be enjoyed in a variety of ways. It pairs well with fruits, crackers, and cured meats. Pannerone is a favorite among cheese lovers for its smooth and luscious texture. It is the perfect addition to any cheese board or recipe.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"250g","stock":14},{"name":"Queso de Murcia","description":"Queso de Murcia is a semi-soft cheese made from pasteurized goat's milk in the region of Murcia, Spain. It has a smooth creamy texture with a mild and slightly tangy flavor. The cheese is typically aged for about 3 months, during which it develops a natural rind. Queso de Murcia is a versatile cheese that can be enjoyed on its own, sliced in sandwiches, or melted in various dishes.","category":"Semi-soft cheese","price":"$9.99","country_of_origin":"Spain","weight":"200 grams","stock":7},{"name":"Reblochon","description":"Reblochon is a soft, creamy cheese with a mild flavor. It is made from raw cow's milk and has a distinctive orange rind. The cheese has a rich and buttery taste, with a slightly nutty finish. Reblochon is traditionally made in the French Alps and is a key ingredient in the famous dish Tartiflette. It is best enjoyed when melted, making it a perfect cheese for fondues and gratins.","category":"Soft Cheese","price":"$10.99","country_of_origin":"France","weight":"250 grams","stock":7},{"name":"San Simon","description":"San Simon is a semi-soft cheese with a distinctive smoky flavor. It is made from cow's milk and has a smooth, creamy texture. The cheese is lightly smoked over birch wood, which gives it a unique aroma and taste. It is aged for about three months to develop its flavors. San Simon is a popular cheese from Spain, specifically from the region of Galicia. It is often enjoyed on its own or melted in dishes like sandwiches or quesadillas.","category":"Semi-soft cheese","price":"$8.99","country_of_origin":"Spain","weight":"200 grams","stock":12},{"name":"Tomme de Savoie","description":"Tomme de Savoie is a semi-soft, pressed cheese from the Savoie region in southeastern France. It is made from raw cow's milk and has a pale yellow to ivory color. The cheese has a mild and slightly nutty flavor, with subtle hints of grass and earth. It is often described as having a creamy and smooth texture. Tomme de Savoie is typically aged for around two to four months, during which it develops a natural, bloomy rind. This cheese is a perfect choice for cheese platters, sandwiches, and melting in various dishes.","category":"Semi-soft","price":"$8.99","country_of_origin":"France","weight":"250 grams","stock":13},{"name":"Unsalted Butter","description":"Unsalted Butter is a type of dairy product made from cream and contains a high percentage of milk fat. It is golden yellow in color and has a smooth and creamy texture. This butter has a more subtle and milder flavor compared to salted butter, making it a versatile ingredient for both sweet and savory dishes. It is widely used in baking, cooking, and as a spread. Unsalted Butter is often preferred by those who are following a low sodium diet or who want to control the amount of salt in their recipes.","category":"Dairy","price":"$4.99","country_of_origin":"Various","weight":"1 pound","stock":13},{"name":"Valkenburg","description":"Valkenburg is a semi-hard cheese that originates from the Netherlands. It is named after the city of Valkenburg, which is famous for its historic castle. This cheese is made from cow's milk and has a pale yellow interior with small irregular holes. It has a smooth and creamy texture with a mild and slightly salty flavor. Valkenburg cheese is often enjoyed on its own or melted on sandwiches and burgers.","category":"Semi-hard","price":"$7.99","country_of_origin":"Netherlands","weight":"200 grams","stock":12},{"name":"Waimata Farmhouse Blue","description":"Waimata Farmhouse Blue is a rich and creamy blue cheese with a distinctive flavor. Made from locally sourced cow's milk, this artisanal cheese is carefully aged to develop its unique taste and texture. It has a slightly crumbly yet smooth consistency, with luscious veins of blue mold permeating throughout. The flavor profile is bold and tangy, with hints of earthiness and sweetness. Waimata Farmhouse Blue is a versatile cheese that pairs well with fresh fruits, crusty bread, and a glass of full-bodied red wine.","category":"Blue Cheese","price":"$12.99","country_of_origin":"New Zealand","weight":"150 grams","stock":7},{"name":"Xynomizythra","description":"Xynomizythra is a traditional Greek cheese made from sheep or goat milk. It has a crumbly texture with a slightly tangy and salty taste. The cheese is aged for a short period, allowing it to develop a rich and creamy flavor. Xynomizythra is often used in traditional Greek recipes, such as salads and pastries. It pairs well with fruits and honey, adding a savory element to sweet dishes.","category":"Hard cheese","price":"$8.99","country_of_origin":"Greece","weight":"200 grams","stock":12},{"name":"Yarra Valley Ashed Pyramid","description":"Yarra Valley Ashed Pyramid is a soft, creamy goat's milk cheese with a delicate ashed rind. It is handmade in small batches by skilled cheesemakers in the Yarra Valley region of Australia. The cheese has a smooth texture and a mild, slightly tangy flavor. It pairs well with crusty bread and crisp white wines.","category":"Goat cheese","price":"$10","country_of_origin":"Australia","weight":"200g","stock":12},{"name":"Zanetti Grana Padano","description":"Zanetti Grana Padano is a classic Italian cheese with a rich, nutty flavor and a firm texture. Made from pasteurized cow's milk, it is aged for a minimum of 12 months, giving it a complex and intense taste. This cheese is perfect for grating over pasta dishes or enjoying on its own. It pairs well with bold red wines and crusty bread. Zanetti Grana Padano is a versatile and delicious cheese that is sure to elevate any recipe.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Italy","weight":"1 pound","stock":12},{"name":"Abbaye de Belloc","description":"Abbaye de Belloc is a semi-hard French cheese made from sheep's milk. It is produced by Benedictine monks at the Abbaye de Notre-Dame de Belloc monastery in the Pyrénées-Atlantiques region. This cheese has a smooth and rich texture with a nutty and slightly sweet flavor. It has a natural rind that is firm and dark brown in color. Abbaye de Belloc is a popular cheese that pairs well with fruits and is often enjoyed with a glass of red wine.","category":"Semi-hard","price":"8.99","country_of_origin":"France","weight":"200g","stock":14},{"name":"Bavarian Bergkase","description":"Bavarian Bergkase is a semi-hard cheese made from cow's milk. It is produced in the Bavarian region of Germany. This cheese has a creamy and nutty flavor with a slightly sweet aroma. The texture is firm and slightly crumbly, making it perfect for slicing or grating. It pairs well with crusty bread, fruits, and a glass of red wine. Its aging process gives it a distinct taste that is loved by cheese enthusiasts.","category":"Semi-hard cheese","price":"$9.99","country_of_origin":"Germany","weight":"250 grams","stock":15},{"name":"Cheshire","description":"Cheshire is a crumbly cheese with a rich and tangy flavor. Known for its pale color and slightly salty taste, it has a smooth and firm texture. This cheese is traditionally made from cow's milk and has a long history dating back to the Roman times. Cheshire cheese is versatile and can be enjoyed on its own, crumbled over salads, or melted in sandwiches. Its unique flavor profile makes it a favorite among cheese lovers.","category":"Hard Cheese","price":"$9.99","country_of_origin":"United Kingdom","weight":"250 grams","stock":8},{"name":"Donniford","description":"Donniford cheese is a unique and flavorful cheese that is aged to perfection. It is made using traditional cheese-making techniques passed down through generations. The cheese has a creamy texture with a hint of tanginess and a slightly nutty flavor. It pairs well with fruits, crackers, and a glass of your favorite wine. Donniford cheese is perfect for adding a gourmet touch to your cheese platters or for enjoying on its own.","category":"Artisan","price":"12","country_of_origin":"France","weight":"200g","stock":"8"},{"name":"Esbareich","description":"Esbareich is a semi-hard cheese with a distinctive nutty and buttery flavor. It is made from the milk of local cows that graze on the lush pastures of the French Pyrenees. The cheese is aged for several months, allowing it to develop a smooth and creamy texture. Esbareich is often enjoyed on its own or paired with fruits and crackers. It is a popular choice for cheese boards and adds a touch of elegance to any gathering.","category":"Semi-hard","price":"$10","country_of_origin":"France","weight":"200g","stock":8},{"name":"Fior Di Latte","description":"Fior Di Latte is a traditional Italian cheese made from cow's milk. It has a smooth, creamy texture and a delicate flavor. The cheese is usually shaped into a round or oval shape and then stretched by hand to create a stringy, elastic texture. It is known for its mild, milky taste and is often used in dishes such as Caprese salad. Fior Di Latte is a versatile cheese that can be enjoyed on its own, melted on pizza, or added to pasta dishes. It is a popular choice among cheese lovers for its soft, luscious texture and delicate flavor.","category":"Fresh Cheese","price":"$5.99","country_of_origin":"Italy","weight":"200g","stock":7},{"name":"Geitost","description":"Geitost is a traditional Norwegian cheese made from goat's milk. It has a unique caramel-like taste with hints of sweetness and a slightly tangy flavor. The cheese has a smooth and creamy texture which makes it perfect for spreading on bread or crackers. Geitost is commonly enjoyed as a dessert cheese and is often served with fresh fruits or paired with cured meats. It is a beloved delicacy in Norway and has gained popularity worldwide.","category":"Semi-hard cheese","price":"$7.99","country_of_origin":"Norway","weight":"250 grams","stock":10},{"name":"Hoop Cheese","description":"Hoop Cheese is a semi-hard, aged cheese made from cow's milk. It has a mild and creamy flavor with a slightly tangy aftertaste. The cheese is produced by pressing the curds in a cylindrical hoop shape, hence the name. It is usually aged for several months, which gives it a firm texture and a golden yellow color. Hoop Cheese is versatile and can be enjoyed on its own, melted on toast, or grated over dishes like pasta or casseroles.","category":"Dairy","price":"$7.99","country_of_origin":"United States","weight":"1 pound","stock":15},{"name":"Innes Brick","description":"Innes Brick is a creamy and aromatic cheese with a distinctive flavor. Made with raw goat's milk, it has a soft and velvety texture that melts in your mouth. The cheese is aged for several weeks to develop its full flavor profile. It offers a unique combination of earthy and tangy notes, with hints of citrus and herbs. Innes Brick is a great addition to any cheese platter or can be enjoyed on its own.","category":"Goat Cheese","price":"15","country_of_origin":"England","weight":"200 grams","stock":8},{"name":"Jura","description":"Jura is a semi-hard cheese that hails from the Jura Mountains, which border France and Switzerland. It has a pale yellow color and a smooth texture. This cheese is known for its rich and nutty flavor, with subtle hints of fruit and caramel. It pairs well with a variety of wines and is often enjoyed on its own or as part of a cheese platter. Its distinctive taste and creamy mouthfeel make it a favorite among cheese connoisseurs.","category":"Semi-hard","price":"$8.99","country_of_origin":"France","weight":"200g","stock":14},{"name":"Kugelkase","description":"Kugelkase is a semi-hard cheese that originated in Germany. It has a creamy and slightly tangy taste, with a smooth and firm texture. Made from cow's milk, this cheese is usually aged for about 2-3 months, resulting in a mild and nutty flavor. Kugelkase is often enjoyed on its own, but it can also be used as a topping for salads or melted in sandwiches. Its unique spherical shape makes it visually appealing, and it pairs well with a variety of wines. Overall, Kugelkase is a versatile and delicious cheese that is loved by many cheese enthusiasts.","category":"Semi-hard","price":"12.99","country_of_origin":"Germany","weight":"200 grams","stock":8},{"name":"Le Lacandou","description":"Le Lacandou is a unique cheese made from the milk of free-range cows in the mountainous regions of France. It is a semi-hard cheese with a smooth texture and a nutty, slightly sweet flavor. The cheese is aged for several months, allowing it to develop complex flavors and a natural rind. Le Lacandou is known for its distinctive aroma and its ability to enhance a wide range of dishes. Whether enjoyed on its own, melted into a rich fondue, or added to a cheese platter, Le Lacandou is sure to delight cheese connoisseurs.","category":"Semi-Hard Cheese","price":"$12.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Montasio","description":"Montasio cheese is a semi-hard cheese that has a delicate but distinctive flavor. It is made from cow's milk and has a pale yellow color with a smooth, firm texture. The cheese is aged for at least two months, which gives it a rich and slightly nutty taste. It is often used as a table cheese or grated over pasta dishes. Montasio cheese is a popular choice for cheese lovers who enjoy a milder but flavorful cheese.","category":"Semi-hard","price":"$10","country_of_origin":"Italy","weight":"250 grams","stock":12},{"name":"Nantais","description":"Nantais is a creamy and buttery cheese that originates from the Pays de la Loire region of France. Made from cow's milk, it showcases a pale yellow interior with a smooth texture. Its flavor is mild, slightly nutty, and slightly tangy, making it an excellent choice for those who prefer a less intense cheese. The Nantais cheese pairs well with fruits, especially apples and pears, and is a delightful addition to cheese boards and sandwiches.","category":"Soft Cheese","price":"$8.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Orb Weaver","description":"Orb Weaver is a unique and flavorful cheese crafted by skilled artisans. Made from the finest quality milk, it undergoes a meticulous aging process to develop its distinctive taste and texture. With rich, nutty flavors and a hint of sweetness, this cheese is a delight for cheese connoisseurs. The texture is firm yet creamy, making it perfect for slicing and melting. Orb Weaver pairs well with a variety of accompaniments, such as crackers, fruits, and wines. Add a touch of elegance to your cheese board with Orb Weaver.","category":"Artisan Cheese","price":"$9.99","country_of_origin":"Italy","weight":"200 grams","stock":10},{"name":"Paneer Tikka","description":"Paneer Tikka is a popular Indian cheese dish that is made by marinating cubes of paneer cheese in a mixture of yogurt, spices, and lemon juice. The marinated cheese is then cooked on a skewer and traditionally barbecued or cooked in a tandoor. The result is a flavorful and slightly smoky cheese with a soft and chewy texture. Paneer Tikka is often served as an appetizer or snack, and it pairs well with mint chutney or a squeeze of fresh lemon juice.","category":"Indian Cheese","price":"$6","country_of_origin":"India","weight":"200 grams","stock":8},{"name":"Queso de Bola","description":"Queso de Bola is a type of Edam cheese that originated in the Netherlands. It is a semi-hard cheese with a firm and smooth texture. The cheese is traditionally coated in red wax, giving it a unique appearance. Queso de Bola has a mild and slightly nutty flavor that becomes richer and more complex as it ages. It is often enjoyed as a snacking cheese or used in various dishes such as sandwiches or salads.","category":"Semi-hard cheese","price":"$10","country_of_origin":"Netherlands","weight":"500 grams","stock":10},{"name":"Red Hawk","description":"Red Hawk is a soft-ripened cheese made from organic cow's milk. It has a pale orange washed rind that is slightly sticky and a creamy, pale yellow interior with a rich, buttery flavor. The cheese is aged for about three weeks, during which it develops a pungent aroma and a tangy taste. Red Hawk is categorized as a triple-cream cheese due to its high butterfat content, making it extremely indulgent and decadent. It pairs well with crusty bread, fruity preserves, and full-bodied red wines.","category":"Soft Cheese","price":"$8","country_of_origin":"United States","weight":"8 oz","stock":12},{"name":"Success Cheese","description":"Success Cheese is a delicious and creamy cheese that melts in your mouth. Made from the finest quality milk, it has a rich and distinct flavor that will leave you craving for more. This cheese is perfect for spreading on crackers or for adding a touch of luxury to your favorite dish. Whether you're hosting a dinner party or enjoying a cozy night in, Success Cheese is the perfect choice.","category":"Dairy","price":"$9","country_of_origin":"France","weight":"200g","stock":15},{"name":"Tyn Grug","description":"Tyn Grug is a delectable cheese with a distinctive flavor and creamy texture. Made from premium cow's milk, it is carefully aged to perfection. The flavors are rich, with notes of nuttiness and a subtle tang. This artisanal cheese is perfect for cheese boards, sandwiches, or incorporating into your favorite recipes. Tyn Grug pairs wonderfully with crisp white wines or a refreshing cider.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Wales","weight":"200 grams","stock":12},{"name":"Ulloa","description":"Ulloa is a semi-soft cheese made from cow's milk that originates from Spain. Its creamy and smooth texture is complemented by a mild and buttery flavor. It has a pale yellow interior with a thin, light orange rind. Ulloa is often used as a table cheese, enjoyed on its own or used in various dishes. Its versatility makes it a popular choice for melting, grilling, or adding to sandwiches. This cheese is an excellent option for those who prefer a mild and approachable flavor profile.","category":"Semi-Soft Cheese","price":"8","country_of_origin":"Spain","weight":"250 grams","stock":"14"},{"name":"Vasterbotten","description":"Vasterbotten is a hard and crumbly cheese with a distinct and tangy flavor. It has a rich and nutty taste with hints of caramel and a slightly salty finish. This Swedish cheese is aged for a minimum of 12 months, allowing it to develop complex flavors and a firm texture. Vasterbotten cheese is often grated and used as a topping for dishes like Swedish meatballs or gratins. It pairs well with crisp, acidic white wines and fruity red wines.","category":"Hard Cheese","price":"$9.99","country_of_origin":"Sweden","weight":"200 grams","stock":12},{"name":"Waterloo","description":"Waterloo is a semi-soft cow's milk cheese that is crafted in Belgium. It is known for its smooth and creamy texture, with a slightly tangy and nutty flavor. Made with care and expertise, it undergoes a meticulous aging process which results in a rich and complex taste. Waterloo cheese is perfect for melting and adding depth to various dishes, or simply enjoying on its own. Its distinctive orange rind adds an attractive touch to any cheese plate.","category":"Semi-Soft Cheese","price":"$7.99","country_of_origin":"Belgium","weight":"200 grams","stock":10},{"name":"Yorkshire Wensleydale","description":"Yorkshire Wensleydale is a classic crumbly cheese with a fresh, clean flavor. Made in the Yorkshire Dales of England, this cheese has a unique character that comes from the quality of the local milk and the traditional methods used to make it. The cheese has a slightly tangy taste with a hint of sweetness. It crumbles easily, making it perfect for adding to salads or crumbling over pastas. The cheese has been made in the area for centuries, and it continues to be a beloved local favorite.","category":"Crumbly Cheese","price":"$7.99","country_of_origin":"England","weight":"200g","stock":9},{"name":"Ziafat","description":"Ziafat is a delightful and aromatic cheese that is crafted with care. It is made using traditional methods and aged to perfection to bring out its unique flavor profile. The cheese has a smooth and creamy texture with hints of nuttiness and sweetness. It pairs beautifully with fruits, honey, and wine. Ziafat is a perfect choice for cheese boards, sandwiches, or as a topping for salads. Try this exquisite cheese and experience a taste of true craftsmanship.","category":"Artisanal Cheese","price":"$9.99","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Allgauer Emmentaler","description":"Allgauer Emmentaler is a traditional Swiss cheese with a rich and nutty flavor. It is made from cow's milk and has a distinctive large holes throughout the cheese. The cheese is aged for around 4 to 12 months, which gives it a firm and slightly elastic texture. It is perfect for melting and often used in dishes like fondue and sandwiches. Allgauer Emmentaler is a popular choice for cheese lovers who appreciate a classic Swiss taste.","category":"Firm Cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"250 grams","stock":14},{"name":"Belper Knolle","description":"Belper Knolle is a Swiss cheese known for its unique appearance and intense flavor. It is made using a traditional Alpine recipe that dates back centuries. The cheese is formed into small balls and then coated with a mixture of garlic, salt, and black pepper, giving it a distinct savory taste. It has a firm texture and crumbles easily, making it perfect for grating over pasta or adding to salads. Belper Knolle is a must-try for cheese lovers looking for a bold and flavorful experience.","category":"Hard cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"100 grams","stock":7},{"name":"Cauldron Cheese","description":"Cauldron Cheese is a delicious artisanal cheese made from the finest ingredients. It is handcrafted by skilled cheesemakers using traditional methods, resulting in a cheese with a rich and creamy flavor. Made with love and care, Cauldron Cheese is aged to perfection, allowing its unique flavors to develop and mature. Whether enjoyed on its own or as part of a cheese platter, Cauldron Cheese is sure to delight cheese lovers. Its smooth texture and distinct taste make it a perfect choice for any occasion.","category":"Artisanal Cheese","price":"10","country_of_origin":"France","weight":"200 grams","stock":12},{"name":"Duddleswell","description":"Duddleswell is a delicious artisan cheese with a rich and creamy texture. It is made from the finest quality cow's milk, handcrafted by skilled cheesemakers. The cheese has a unique flavor profile, with hints of nuttiness and a subtle tang. Duddleswell is aged to perfection, allowing its flavors to develop and intensify. It pairs perfectly with a variety of accompaniments, such as crackers, fruits, and preserves. Whether enjoyed on its own or as part of a cheese board, Duddleswell is sure to delight any cheese lover.","category":"Artisan Cheese","price":"$10","country_of_origin":"United Kingdom","weight":"200g","stock":12},{"name":"End la Raclette","description":"End la Raclette is a semi-hard cow's milk cheese from Switzerland. It has a pale yellow color and a creamy texture. The cheese is famous for its melting qualities and is traditionally used in the Swiss dish called Raclette, where it is melted and scraped onto boiled potatoes. End la Raclette has a mild and nutty flavor with a hint of fruitiness. It pairs well with charcuterie, pickles, and crusty bread. Enjoy this delicious cheese as a main ingredient or as a delightful addition to any cheese platter.","category":"Semi-hard cheese","price":"$10","country_of_origin":"Switzerland","weight":"200 grams","stock":8},{"name":"Fanaost","description":"Fanaost is a delicious Norwegian cheese known for its rich and creamy flavor. Made from the finest cow's milk in the traditional Norwegian way, it is aged to perfection, resulting in a smooth and slightly tangy taste. With a firm yet creamy texture, Fanaost has a beautiful pale yellow color and is dotted with small holes. This cheese is perfect for melting on sandwiches or enjoying on a cheese platter.","category":"Hard Cheese","price":"$12.99","country_of_origin":"Norway","weight":"200g","stock":8},{"name":"Goat Gouda","description":"Goat Gouda is a delicious and creamy cheese that is made from goat's milk. It has a smooth texture and a slightly sweet and nutty flavor. This cheese is aged for several months, which gives it a rich and complex taste. Goat Gouda pairs well with fruits, honey, and crackers, and is a great addition to cheese boards and sandwiches.","category":"Gouda","price":"8","country_of_origin":"Netherlands","weight":"200 grams","stock":"12"},{"name":"Huntingdon Beacon","description":"Huntingdon Beacon cheese is a delicious artisanal creation with a unique blend of flavors. Made from high-quality milk sourced from local farms, this cheese is aged to perfection, resulting in a rich and creamy texture. It has a slightly nutty and earthy taste, with hints of sweetness and a tangy finish. The cheese is perfect for both snacking and cooking, adding depth and complexity to a variety of dishes. Try it melted on a grilled cheese sandwich or crumbled on top of a salad for an extra burst of flavor.","category":"Artisanal Cheese","price":"$9.99","country_of_origin":"United States","weight":"200g","stock":12},{"name":"Il Boschetto al Tartufo","description":"Il Boschetto al Tartufo is a delicious Italian cheese made with a combination of cow and sheep milk. It is infused with black truffles, which gives it a unique and intense flavor. The cheese has a creamy and slightly nutty taste, with the truffles adding a rich earthiness. It pairs well with crusty bread and is perfect for cheese boards or special occasions. This cheese is a true delicacy and a must-try for any cheese lover.","category":"Semi-soft cheese","price":"$10","country_of_origin":"Italy","weight":"200 grams","stock":8},{"name":"Jindi Brie","description":"Jindi Brie is a creamy and indulgent cheese with a delicate bloomy rind. Its rich, buttery flavor is complemented by a smooth texture, making it a favorite among cheese lovers. This brie is perfect for spreading on crackers or bread, and pairs well with a variety of accompaniments such as fruit or honey. Made with high-quality milk, Jindi Brie is aged to perfection, resulting in a cheese that is sure to please.","category":"Soft Cheese","price":"$9.99","country_of_origin":"Australia","weight":"250g","stock":14},{"name":"Kugelhupf","description":"Kugelhupf is a type of cheese originating from Germany. It is a soft and creamy cheese that is typically made from cow's milk. It has a mild and slightly tangy flavor, with a smooth and velvety texture. Kugelhupf cheese is often used as a spread on bread or crackers, and it can also be melted into sauces or used in cooking. It pairs well with fruity wines and is a popular choice for cheese boards and appetizers.","category":"Soft Cheese","price":"$8.99","country_of_origin":"Germany","weight":"200g","stock":12},{"name":"Labne","description":"Labne is a type of yogurt cheese commonly found in Middle Eastern cuisine. It is made by straining yogurt to remove the whey, resulting in a thick and creamy texture. Labne has a tangy and slightly sour taste, similar to yogurt but with a richer flavor. It is often used as a spread or dip, and can be enjoyed with bread, vegetables, or as a topping for dishes. Labne is a versatile and nutritious cheese, packed with probiotics and protein.","category":"Yogurt Cheese","price":"$5","country_of_origin":"Middle East","weight":"250 grams","stock":10},{"name":"Macconais","description":"Macconais is a semi-hard creamy cheese made from pasteurized cow's milk. It has a smooth texture and a delicate buttery flavor with hints of nuttiness. The cheese is aged for several months, allowing its flavors to develop and intensify. It pairs well with crusty bread, fresh fruits, and light-bodied wines. Macconais is a perfect choice for cheese boards, salads, or melted in sandwiches. It is a versatile cheese loved by cheese connoisseurs around the world.","category":"Semi-hard cheese","price":"$9.99","country_of_origin":"France","weight":"200 grams","stock":7},{"name":"Nunehumer","description":"Nunehumer is a unique artisanal cheese known for its complex flavors and creamy texture. Made from the milk of free-range cows grazing in the picturesque valleys of Switzerland, this cheese embodies the essence of the region. Aged for several months, Nunehumer develops a rich and nutty taste with subtle hints of fruit and earthiness. It pairs well with crusty bread and fruity wines, making it a perfect addition to any cheese board. Experience the tradition and craftsmanship of Swiss cheesemaking with Nunehumer.","category":"Artisanal Cheese","price":"$9.99","country_of_origin":"Switzerland","weight":"200g","stock":12},{"name":"Odenwald","description":"Odenwald is a creamy and nutty cheese hailing from Germany. It is made from cow's milk and aged for several months to develop its distinctive flavors. Its smooth and velvety texture pairs beautifully with a variety of accompaniments. Odenwald is often enjoyed on a cheese board or melted into dishes for a rich and savory taste experience.","category":"Semi-hard","price":"$8.99","country_of_origin":"Germany","weight":"200 grams","stock":14},{"name":"Pant ys Gawn","description":"Pant ys Gawn is a delicious cheese with a rich and creamy texture. Made from the finest cow's milk, this cheese is aged to perfection, resulting in a full-bodied flavor with hints of nuttiness. Its smooth and velvety consistency makes it a perfect choice for cheese boards and sandwiches. The distinctive taste of Pant ys Gawn pairs well with fruits, crackers, and a glass of red wine. Try this Welsh delicacy today and experience the true essence of artisanal cheese.","category":"Soft Cheese","price":"10","country_of_origin":"Wales","weight":"200g","stock":14},{"name":"Quatre-Vents","description":"Quatre-Vents is a soft and creamy cheese that originates from France. It is made from cow's milk and has a bloomy white rind. The cheese has a rich and buttery flavor with hints of mushrooms and earthiness. Its texture is smooth and velvety, making it ideal for spreading on crackers or crusty bread. Quatre-Vents is a versatile cheese that pairs well with a variety of accompaniments, such as fresh fruits or a glass of wine.","category":"Soft Cheese","price":"$9.99","country_of_origin":"France","weight":"200g","stock":13},{"name":"Red Leicester","description":"Red Leicester is a traditional English cheese that originated in Leicestershire. It is a firm and crumbly cheese with a mellow, nutty flavor. Made from cow's milk, it has a distinctive orange color that comes from the natural addition of annatto. Red Leicester is often compared to cheddar but has a slightly sweeter and less sharp taste. It is a versatile cheese that can be enjoyed on its own, grated over dishes, or melted in recipes like macaroni and cheese. ","category":"Hard Cheese","price":"$5.99","country_of_origin":"England","weight":"200 grams","stock":12},{"name":"Sainte Maure","description":"Sainte Maure is a traditional French cheese made from goat's milk. It has a cylindrical shape with a distinctive straw running through its center. This unique cheese has a delicate and creamy texture, with a slightly tangy and earthy flavor. It is often enjoyed with crusty bread or as a topping for salads. Sainte Maure is classified as a soft-ripened cheese and is aged for about two weeks. The cheese originates from the Loire Valley in France, where it has been produced for centuries.","category":"Goat's Milk Cheese","price":"$9.99","country_of_origin":"France","weight":"250 grams","stock":13},{"name":"Upper Bench","description":"Upper Bench cheese is a high-quality artisanal cheese made from locally sourced ingredients. It is known for its exceptional taste and texture. The cheese is aged to perfection, resulting in a rich and complex flavor profile. It pairs well with a variety of foods and is the perfect addition to any cheese platter or recipe. Enjoy the unique experience of Upper Bench cheese today!","category":"Artisanal","price":"$9.99","country_of_origin":"Canada","weight":"150g","stock":12},{"name":"Vega","description":"Vega is a semi-hard cheese with a mild and creamy flavor. It is made from cow's milk and is aged for several months, giving it a smooth and slightly nutty taste. This cheese has a firm texture and is perfect for melting or slicing. Made in the picturesque countryside of France, Vega is an excellent addition to any cheeseboard or recipe. ","category":"Semi-hard","price":"$8","country_of_origin":"France","weight":"200g","stock":15},{"name":"Wicklow Blue","description":"Wicklow Blue is a creamy and tangy blue cheese with a delicate flavor that is sure to delight your taste buds. Made from the highest quality cow's milk, this cheese is carefully aged to develop its distinct blue veins and creamy texture. It pairs well with crackers, bread, and fruit, making it a great addition to any cheese platter or charcuterie board. Try it crumbled on top of a salad or melted into a sauce for a unique and delicious flavor. ","category":"Blue Cheese","price":"$8.99","country_of_origin":"Ireland","weight":"200g","stock":15},{"name":"Yorkshire Fettle","description":"Yorkshire Fettle is a traditional British cheese with a crumbly texture and a tangy flavor. It is made from sheep's milk which gives it a unique and distinct taste. The cheese is aged for several months, allowing it to develop its rich and complex flavors. Yorkshire Fettle is often described as a combination of a crumbly Cheshire cheese and a sharp Lancashire cheese. It is perfect for cheeseboards and can also be used in cooking to add a deliciously creamy and tangy flavor to dishes.","category":"Sheep's Milk Cheese","price":"$9.99","country_of_origin":"United Kingdom","weight":"200 grams","stock":12},{"name":"Zelu Koloria","description":"Zelu Koloria is a delightful artisanal cheese that hails from the Basque region in northern Spain. It is a semi-hard cheese made from the milk of local sheep, giving it a unique and rich flavor. The cheese is aged for several months, allowing it to develop a creamy and slightly nutty taste. Zelu Koloria is perfect for pairing with savory charcuterie and crusty bread. Its smooth texture and distinct aroma make it a favorite among cheese enthusiasts. Whether enjoyed on its own or as part of a cheeseboard, Zelu Koloria is sure to delight your taste buds.","category":"Semi-hard cheese","price":"$9.99","country_of_origin":"Spain","weight":"200 grams","stock":12}]